RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
/* 0x10C : tzc_bmx_s1 */
#define TZC_SEC_TZC_BMX_S1_OFFSET         (0x10C)
#define TZC_SEC_TZC_BMX_S10_TZSID_EN      TZC_SEC_TZC_BMX_S10_TZSID_EN
#define TZC_SEC_TZC_BMX_S10_TZSID_EN_POS  (0U)
#define TZC_SEC_TZC_BMX_S10_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S10_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S10_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S10_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S10_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S10_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S10_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S11_TZSID_EN      TZC_SEC_TZC_BMX_S11_TZSID_EN
#define TZC_SEC_TZC_BMX_S11_TZSID_EN_POS  (2U)
#define TZC_SEC_TZC_BMX_S11_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S11_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S11_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S11_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S11_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S11_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S11_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S12_TZSID_EN      TZC_SEC_TZC_BMX_S12_TZSID_EN
#define TZC_SEC_TZC_BMX_S12_TZSID_EN_POS  (4U)
#define TZC_SEC_TZC_BMX_S12_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S12_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S12_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S12_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S12_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S12_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S12_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S13_TZSID_EN      TZC_SEC_TZC_BMX_S13_TZSID_EN
#define TZC_SEC_TZC_BMX_S13_TZSID_EN_POS  (6U)
#define TZC_SEC_TZC_BMX_S13_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S13_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S13_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S13_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S13_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S13_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S13_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S14_TZSID_EN      TZC_SEC_TZC_BMX_S14_TZSID_EN
#define TZC_SEC_TZC_BMX_S14_TZSID_EN_POS  (8U)
#define TZC_SEC_TZC_BMX_S14_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S14_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S14_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S14_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S14_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S14_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S14_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S15_TZSID_EN      TZC_SEC_TZC_BMX_S15_TZSID_EN
#define TZC_SEC_TZC_BMX_S15_TZSID_EN_POS  (10U)
#define TZC_SEC_TZC_BMX_S15_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S15_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S15_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S15_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S15_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S15_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S15_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S16_TZSID_EN      TZC_SEC_TZC_BMX_S16_TZSID_EN
#define TZC_SEC_TZC_BMX_S16_TZSID_EN_POS  (12U)
#define TZC_SEC_TZC_BMX_S16_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S16_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S16_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S16_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S16_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S16_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S16_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S17_TZSID_EN      TZC_SEC_TZC_BMX_S17_TZSID_EN
#define TZC_SEC_TZC_BMX_S17_TZSID_EN_POS  (14U)
#define TZC_SEC_TZC_BMX_S17_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S17_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S17_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S17_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S17_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S17_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S17_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S18_TZSID_EN      TZC_SEC_TZC_BMX_S18_TZSID_EN
#define TZC_SEC_TZC_BMX_S18_TZSID_EN_POS  (16U)
#define TZC_SEC_TZC_BMX_S18_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S18_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S18_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S18_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S18_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S18_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S18_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S19_TZSID_EN      TZC_SEC_TZC_BMX_S19_TZSID_EN
#define TZC_SEC_TZC_BMX_S19_TZSID_EN_POS  (18U)
#define TZC_SEC_TZC_BMX_S19_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S19_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S19_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S19_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S19_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S19_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S19_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S1A_TZSID_EN      TZC_SEC_TZC_BMX_S1A_TZSID_EN
#define TZC_SEC_TZC_BMX_S1A_TZSID_EN_POS  (20U)
#define TZC_SEC_TZC_BMX_S1A_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S1A_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S1A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1A_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S1A_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1A_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S1B_TZSID_EN      TZC_SEC_TZC_BMX_S1B_TZSID_EN
#define TZC_SEC_TZC_BMX_S1B_TZSID_EN_POS  (22U)
#define TZC_SEC_TZC_BMX_S1B_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S1B_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S1B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1B_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S1B_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1B_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S1C_TZSID_EN      TZC_SEC_TZC_BMX_S1C_TZSID_EN
#define TZC_SEC_TZC_BMX_S1C_TZSID_EN_POS  (24U)
#define TZC_SEC_TZC_BMX_S1C_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S1C_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S1C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1C_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S1C_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1C_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S1D_TZSID_EN      TZC_SEC_TZC_BMX_S1D_TZSID_EN
#define TZC_SEC_TZC_BMX_S1D_TZSID_EN_POS  (26U)
#define TZC_SEC_TZC_BMX_S1D_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S1D_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S1D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1D_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S1D_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1D_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S1E_TZSID_EN      TZC_SEC_TZC_BMX_S1E_TZSID_EN
#define TZC_SEC_TZC_BMX_S1E_TZSID_EN_POS  (28U)
#define TZC_SEC_TZC_BMX_S1E_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S1E_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S1E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1E_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S1E_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1E_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S1F_TZSID_EN      TZC_SEC_TZC_BMX_S1F_TZSID_EN
#define TZC_SEC_TZC_BMX_S1F_TZSID_EN_POS  (30U)
#define TZC_SEC_TZC_BMX_S1F_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S1F_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S1F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1F_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S1F_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S1F_TZSID_EN_POS))

/* 0x110 : tzc_bmx_s2 */
#define TZC_SEC_TZC_BMX_S2_OFFSET         (0x110)
#define TZC_SEC_TZC_BMX_S20_TZSID_EN      TZC_SEC_TZC_BMX_S20_TZSID_EN
#define TZC_SEC_TZC_BMX_S20_TZSID_EN_POS  (0U)
#define TZC_SEC_TZC_BMX_S20_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S20_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S20_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S20_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S20_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S20_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S20_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S21_TZSID_EN      TZC_SEC_TZC_BMX_S21_TZSID_EN
#define TZC_SEC_TZC_BMX_S21_TZSID_EN_POS  (2U)
#define TZC_SEC_TZC_BMX_S21_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S21_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S21_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S21_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S21_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S21_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S21_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S22_TZSID_EN      TZC_SEC_TZC_BMX_S22_TZSID_EN
#define TZC_SEC_TZC_BMX_S22_TZSID_EN_POS  (4U)
#define TZC_SEC_TZC_BMX_S22_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S22_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S22_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S22_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S22_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S22_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S22_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S23_TZSID_EN      TZC_SEC_TZC_BMX_S23_TZSID_EN
#define TZC_SEC_TZC_BMX_S23_TZSID_EN_POS  (6U)
#define TZC_SEC_TZC_BMX_S23_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S23_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S23_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S23_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S23_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S23_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S23_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S24_TZSID_EN      TZC_SEC_TZC_BMX_S24_TZSID_EN
#define TZC_SEC_TZC_BMX_S24_TZSID_EN_POS  (8U)
#define TZC_SEC_TZC_BMX_S24_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S24_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S24_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S24_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S24_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S24_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S24_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S25_TZSID_EN      TZC_SEC_TZC_BMX_S25_TZSID_EN
#define TZC_SEC_TZC_BMX_S25_TZSID_EN_POS  (10U)
#define TZC_SEC_TZC_BMX_S25_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S25_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S25_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S25_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S25_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S25_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S25_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S26_TZSID_EN      TZC_SEC_TZC_BMX_S26_TZSID_EN
#define TZC_SEC_TZC_BMX_S26_TZSID_EN_POS  (12U)
#define TZC_SEC_TZC_BMX_S26_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S26_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S26_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S26_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S26_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S26_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S26_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S27_TZSID_EN      TZC_SEC_TZC_BMX_S27_TZSID_EN
#define TZC_SEC_TZC_BMX_S27_TZSID_EN_POS  (14U)
#define TZC_SEC_TZC_BMX_S27_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S27_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S27_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S27_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S27_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S27_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S27_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S28_TZSID_EN      TZC_SEC_TZC_BMX_S28_TZSID_EN
#define TZC_SEC_TZC_BMX_S28_TZSID_EN_POS  (16U)
#define TZC_SEC_TZC_BMX_S28_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S28_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S28_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S28_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S28_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S28_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S28_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S29_TZSID_EN      TZC_SEC_TZC_BMX_S29_TZSID_EN
#define TZC_SEC_TZC_BMX_S29_TZSID_EN_POS  (18U)
#define TZC_SEC_TZC_BMX_S29_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S29_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S29_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S29_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S29_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S29_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S29_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S2A_TZSID_EN      TZC_SEC_TZC_BMX_S2A_TZSID_EN
#define TZC_SEC_TZC_BMX_S2A_TZSID_EN_POS  (20U)
#define TZC_SEC_TZC_BMX_S2A_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S2A_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S2A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2A_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S2A_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2A_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S2B_TZSID_EN      TZC_SEC_TZC_BMX_S2B_TZSID_EN
#define TZC_SEC_TZC_BMX_S2B_TZSID_EN_POS  (22U)
#define TZC_SEC_TZC_BMX_S2B_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S2B_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S2B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2B_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S2B_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2B_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S2C_TZSID_EN      TZC_SEC_TZC_BMX_S2C_TZSID_EN
#define TZC_SEC_TZC_BMX_S2C_TZSID_EN_POS  (24U)
#define TZC_SEC_TZC_BMX_S2C_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S2C_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S2C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2C_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S2C_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2C_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S2D_TZSID_EN      TZC_SEC_TZC_BMX_S2D_TZSID_EN
#define TZC_SEC_TZC_BMX_S2D_TZSID_EN_POS  (26U)
#define TZC_SEC_TZC_BMX_S2D_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S2D_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S2D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2D_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S2D_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2D_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S2E_TZSID_EN      TZC_SEC_TZC_BMX_S2E_TZSID_EN
#define TZC_SEC_TZC_BMX_S2E_TZSID_EN_POS  (28U)
#define TZC_SEC_TZC_BMX_S2E_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S2E_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S2E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2E_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S2E_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2E_TZSID_EN_POS))
#define TZC_SEC_TZC_BMX_S2F_TZSID_EN      TZC_SEC_TZC_BMX_S2F_TZSID_EN
#define TZC_SEC_TZC_BMX_S2F_TZSID_EN_POS  (30U)
#define TZC_SEC_TZC_BMX_S2F_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_BMX_S2F_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_BMX_S2F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2F_TZSID_EN_POS)
#define TZC_SEC_TZC_BMX_S2F_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_BMX_S2F_TZSID_EN_POS))

