RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
/* 0x114 : tzc_bmx_s_lock */
#define TZC_SEC_TZC_BMX_S_LOCK_OFFSET       (0x114)
#define TZC_SEC_TZC_BMX_S10_TZSID_LOCK      TZC_SEC_TZC_BMX_S10_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S10_TZSID_LOCK_POS  (0U)
#define TZC_SEC_TZC_BMX_S10_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S10_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S10_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S10_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S10_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S10_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S10_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S11_TZSID_LOCK      TZC_SEC_TZC_BMX_S11_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S11_TZSID_LOCK_POS  (1U)
#define TZC_SEC_TZC_BMX_S11_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S11_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S11_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S11_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S11_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S11_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S11_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S12_TZSID_LOCK      TZC_SEC_TZC_BMX_S12_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S12_TZSID_LOCK_POS  (2U)
#define TZC_SEC_TZC_BMX_S12_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S12_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S12_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S12_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S12_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S12_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S12_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S13_TZSID_LOCK      TZC_SEC_TZC_BMX_S13_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S13_TZSID_LOCK_POS  (3U)
#define TZC_SEC_TZC_BMX_S13_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S13_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S13_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S13_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S13_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S13_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S13_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S14_TZSID_LOCK      TZC_SEC_TZC_BMX_S14_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S14_TZSID_LOCK_POS  (4U)
#define TZC_SEC_TZC_BMX_S14_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S14_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S14_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S14_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S14_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S14_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S14_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S15_TZSID_LOCK      TZC_SEC_TZC_BMX_S15_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S15_TZSID_LOCK_POS  (5U)
#define TZC_SEC_TZC_BMX_S15_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S15_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S15_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S15_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S15_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S15_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S15_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S16_TZSID_LOCK      TZC_SEC_TZC_BMX_S16_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S16_TZSID_LOCK_POS  (6U)
#define TZC_SEC_TZC_BMX_S16_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S16_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S16_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S16_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S16_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S16_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S16_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S17_TZSID_LOCK      TZC_SEC_TZC_BMX_S17_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S17_TZSID_LOCK_POS  (7U)
#define TZC_SEC_TZC_BMX_S17_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S17_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S17_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S17_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S17_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S17_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S17_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S18_TZSID_LOCK      TZC_SEC_TZC_BMX_S18_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S18_TZSID_LOCK_POS  (8U)
#define TZC_SEC_TZC_BMX_S18_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S18_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S18_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S18_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S18_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S18_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S18_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S19_TZSID_LOCK      TZC_SEC_TZC_BMX_S19_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S19_TZSID_LOCK_POS  (9U)
#define TZC_SEC_TZC_BMX_S19_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S19_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S19_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S19_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S19_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S19_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S19_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S1A_TZSID_LOCK      TZC_SEC_TZC_BMX_S1A_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S1A_TZSID_LOCK_POS  (10U)
#define TZC_SEC_TZC_BMX_S1A_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S1A_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S1A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1A_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S1A_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1A_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S1B_TZSID_LOCK      TZC_SEC_TZC_BMX_S1B_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S1B_TZSID_LOCK_POS  (11U)
#define TZC_SEC_TZC_BMX_S1B_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S1B_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S1B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1B_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S1B_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1B_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S1C_TZSID_LOCK      TZC_SEC_TZC_BMX_S1C_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S1C_TZSID_LOCK_POS  (12U)
#define TZC_SEC_TZC_BMX_S1C_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S1C_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S1C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1C_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S1C_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1C_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S1D_TZSID_LOCK      TZC_SEC_TZC_BMX_S1D_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S1D_TZSID_LOCK_POS  (13U)
#define TZC_SEC_TZC_BMX_S1D_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S1D_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S1D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1D_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S1D_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1D_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S1E_TZSID_LOCK      TZC_SEC_TZC_BMX_S1E_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S1E_TZSID_LOCK_POS  (14U)
#define TZC_SEC_TZC_BMX_S1E_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S1E_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S1E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1E_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S1E_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1E_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S1F_TZSID_LOCK      TZC_SEC_TZC_BMX_S1F_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S1F_TZSID_LOCK_POS  (15U)
#define TZC_SEC_TZC_BMX_S1F_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S1F_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S1F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1F_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S1F_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S1F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S1F_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S20_TZSID_LOCK      TZC_SEC_TZC_BMX_S20_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S20_TZSID_LOCK_POS  (16U)
#define TZC_SEC_TZC_BMX_S20_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S20_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S20_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S20_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S20_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S20_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S20_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S21_TZSID_LOCK      TZC_SEC_TZC_BMX_S21_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S21_TZSID_LOCK_POS  (17U)
#define TZC_SEC_TZC_BMX_S21_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S21_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S21_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S21_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S21_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S21_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S21_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S22_TZSID_LOCK      TZC_SEC_TZC_BMX_S22_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S22_TZSID_LOCK_POS  (18U)
#define TZC_SEC_TZC_BMX_S22_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S22_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S22_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S22_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S22_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S22_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S22_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S23_TZSID_LOCK      TZC_SEC_TZC_BMX_S23_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S23_TZSID_LOCK_POS  (19U)
#define TZC_SEC_TZC_BMX_S23_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S23_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S23_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S23_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S23_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S23_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S23_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S24_TZSID_LOCK      TZC_SEC_TZC_BMX_S24_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S24_TZSID_LOCK_POS  (20U)
#define TZC_SEC_TZC_BMX_S24_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S24_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S24_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S24_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S24_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S24_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S24_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S25_TZSID_LOCK      TZC_SEC_TZC_BMX_S25_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S25_TZSID_LOCK_POS  (21U)
#define TZC_SEC_TZC_BMX_S25_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S25_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S25_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S25_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S25_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S25_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S25_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S26_TZSID_LOCK      TZC_SEC_TZC_BMX_S26_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S26_TZSID_LOCK_POS  (22U)
#define TZC_SEC_TZC_BMX_S26_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S26_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S26_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S26_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S26_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S26_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S26_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S27_TZSID_LOCK      TZC_SEC_TZC_BMX_S27_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S27_TZSID_LOCK_POS  (23U)
#define TZC_SEC_TZC_BMX_S27_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S27_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S27_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S27_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S27_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S27_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S27_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S28_TZSID_LOCK      TZC_SEC_TZC_BMX_S28_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S28_TZSID_LOCK_POS  (24U)
#define TZC_SEC_TZC_BMX_S28_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S28_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S28_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S28_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S28_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S28_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S28_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S29_TZSID_LOCK      TZC_SEC_TZC_BMX_S29_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S29_TZSID_LOCK_POS  (25U)
#define TZC_SEC_TZC_BMX_S29_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S29_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S29_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S29_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S29_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S29_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S29_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S2A_TZSID_LOCK      TZC_SEC_TZC_BMX_S2A_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S2A_TZSID_LOCK_POS  (26U)
#define TZC_SEC_TZC_BMX_S2A_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S2A_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S2A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2A_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S2A_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2A_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S2B_TZSID_LOCK      TZC_SEC_TZC_BMX_S2B_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S2B_TZSID_LOCK_POS  (27U)
#define TZC_SEC_TZC_BMX_S2B_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S2B_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S2B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2B_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S2B_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2B_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S2C_TZSID_LOCK      TZC_SEC_TZC_BMX_S2C_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S2C_TZSID_LOCK_POS  (28U)
#define TZC_SEC_TZC_BMX_S2C_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S2C_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S2C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2C_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S2C_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2C_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S2D_TZSID_LOCK      TZC_SEC_TZC_BMX_S2D_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S2D_TZSID_LOCK_POS  (29U)
#define TZC_SEC_TZC_BMX_S2D_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S2D_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S2D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2D_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S2D_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2D_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S2E_TZSID_LOCK      TZC_SEC_TZC_BMX_S2E_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S2E_TZSID_LOCK_POS  (30U)
#define TZC_SEC_TZC_BMX_S2E_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S2E_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S2E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2E_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S2E_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2E_TZSID_LOCK_POS))
#define TZC_SEC_TZC_BMX_S2F_TZSID_LOCK      TZC_SEC_TZC_BMX_S2F_TZSID_LOCK
#define TZC_SEC_TZC_BMX_S2F_TZSID_LOCK_POS  (31U)
#define TZC_SEC_TZC_BMX_S2F_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_BMX_S2F_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_BMX_S2F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2F_TZSID_LOCK_POS)
#define TZC_SEC_TZC_BMX_S2F_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_BMX_S2F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_BMX_S2F_TZSID_LOCK_POS))

/* 0x140 : tzc_ocram_tzsrg_ctrl */
#define TZC_SEC_TZC_OCRAM_TZSRG_CTRL_OFFSET   (0x140)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN      TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN_POS  (0U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN_MSK  (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_ID_EN_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN      TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN_POS  (4U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN_MSK  (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_ID_EN_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN      TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN_POS  (8U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN_MSK  (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_ID_EN_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN      TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN_POS  (12U)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN_MSK  (((1U << TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_RX_ID_EN_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_EN         TZC_SEC_TZC_OCRAM_TZSRG_R0_EN
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_EN_POS     (16U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_EN_LEN     (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_EN_MSK     (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_EN_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_EN_UMSK    (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_EN_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_EN         TZC_SEC_TZC_OCRAM_TZSRG_R1_EN
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_EN_POS     (17U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_EN_LEN     (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_EN_MSK     (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_EN_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_EN_UMSK    (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_EN_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_EN         TZC_SEC_TZC_OCRAM_TZSRG_R2_EN
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_EN_POS     (18U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_EN_LEN     (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_EN_MSK     (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_EN_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_EN_UMSK    (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_EN_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_EN         TZC_SEC_TZC_OCRAM_TZSRG_RX_EN
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_EN_POS     (19U)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_EN_LEN     (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_EN_MSK     (((1U << TZC_SEC_TZC_OCRAM_TZSRG_RX_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_RX_EN_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_EN_UMSK    (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_RX_EN_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_RX_EN_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK       TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK_POS   (20U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK_LEN   (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK_MSK   (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_LOCK_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK       TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK_POS   (21U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK_LEN   (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK_MSK   (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_LOCK_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK       TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK_POS   (22U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK_LEN   (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK_MSK   (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_LOCK_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK       TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK_POS   (23U)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK_LEN   (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK_MSK   (((1U << TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_RX_LOCK_POS))

/* 0x144 : tzc_ocram_tzsrg_adr_mask */
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_OFFSET    (0x144)
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK           TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_POS       (0U)
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LEN       (10U)
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_MSK       (((1U << TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_UMSK      (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK      TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK_POS  (16U)
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK_LEN  (1U)
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK_MSK  (((1U << TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK_UMSK (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_ADR_MASK_LOCK_POS))

/* 0x148 : tzc_ocram_tzsrg_r0 */
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_OFFSET     (0x148)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_END        TZC_SEC_TZC_OCRAM_TZSRG_R0_END
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_END_POS    (0U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_END_LEN    (10U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_END_MSK    (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_END_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_END_UMSK   (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_END_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_START      TZC_SEC_TZC_OCRAM_TZSRG_R0_START
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_START_POS  (16U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_START_LEN  (10U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_START_MSK  (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_START_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R0_START_UMSK (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R0_START_POS))

