RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
/* 0x184 : tzc_wram_tzsrg_adr_mask */
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_OFFSET    (0x184)
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK           TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_POS       (0U)
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LEN       (10U)
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_MSK       (((1U << TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_UMSK      (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK      TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK_POS  (16U)
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK_LEN  (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK_MSK  (((1U << TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK_UMSK (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_ADR_MASK_LOCK_POS))

/* 0x188 : tzc_wram_tzsrg_r0 */
#define TZC_SEC_TZC_WRAM_TZSRG_R0_OFFSET     (0x188)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_END        TZC_SEC_TZC_WRAM_TZSRG_R0_END
#define TZC_SEC_TZC_WRAM_TZSRG_R0_END_POS    (0U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_END_LEN    (10U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_END_MSK    (((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_END_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_END_UMSK   (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_END_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R0_START      TZC_SEC_TZC_WRAM_TZSRG_R0_START
#define TZC_SEC_TZC_WRAM_TZSRG_R0_START_POS  (16U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_START_LEN  (10U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_START_MSK  (((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_START_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_START_UMSK (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_START_POS))

/* 0x18C : tzc_wram_tzsrg_r1 */
#define TZC_SEC_TZC_WRAM_TZSRG_R1_OFFSET     (0x18C)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_END        TZC_SEC_TZC_WRAM_TZSRG_R1_END
#define TZC_SEC_TZC_WRAM_TZSRG_R1_END_POS    (0U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_END_LEN    (10U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_END_MSK    (((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_END_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_END_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_END_UMSK   (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_END_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_END_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R1_START      TZC_SEC_TZC_WRAM_TZSRG_R1_START
#define TZC_SEC_TZC_WRAM_TZSRG_R1_START_POS  (16U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_START_LEN  (10U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_START_MSK  (((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_START_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_START_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_START_UMSK (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_START_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_START_POS))

/* 0x190 : tzc_wram_tzsrg_r2 */
#define TZC_SEC_TZC_WRAM_TZSRG_R2_OFFSET     (0x190)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_END        TZC_SEC_TZC_WRAM_TZSRG_R2_END
#define TZC_SEC_TZC_WRAM_TZSRG_R2_END_POS    (0U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_END_LEN    (10U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_END_MSK    (((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_END_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_END_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_END_UMSK   (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_END_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_END_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R2_START      TZC_SEC_TZC_WRAM_TZSRG_R2_START
#define TZC_SEC_TZC_WRAM_TZSRG_R2_START_POS  (16U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_START_LEN  (10U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_START_MSK  (((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_START_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_START_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_START_UMSK (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_START_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_START_POS))

/* 0x194 : tzc_wram_tzsrg_r3 */
#define TZC_SEC_TZC_WRAM_TZSRG_R3_OFFSET (0x194)

/* 0x198 : tzc_wifi_dbg */
#define TZC_SEC_TZC_WIFI_DBG_OFFSET  (0x198)
#define TZC_SEC_TZC_MAC_DBG_DIS      TZC_SEC_TZC_MAC_DBG_DIS
#define TZC_SEC_TZC_MAC_DBG_DIS_POS  (0U)
#define TZC_SEC_TZC_MAC_DBG_DIS_LEN  (1U)
#define TZC_SEC_TZC_MAC_DBG_DIS_MSK  (((1U << TZC_SEC_TZC_MAC_DBG_DIS_LEN) - 1) << TZC_SEC_TZC_MAC_DBG_DIS_POS)
#define TZC_SEC_TZC_MAC_DBG_DIS_UMSK (~(((1U << TZC_SEC_TZC_MAC_DBG_DIS_LEN) - 1) << TZC_SEC_TZC_MAC_DBG_DIS_POS))

/* 0x240 : tzc_pdm_ctrl */
#define TZC_SEC_TZC_PDM_CTRL_OFFSET (0x240)

/* 0x244 : tzc_uart_ctrl */
#define TZC_SEC_TZC_UART_CTRL_OFFSET (0x244)

/* 0x248 : tzc_i2c_ctrl */
#define TZC_SEC_TZC_I2C_CTRL_OFFSET (0x248)

/* 0x24C : tzc_timer_ctrl */
#define TZC_SEC_TZC_TIMER_CTRL_OFFSET (0x24C)

/* 0x250 : tzc_i2s_ctrl */
#define TZC_SEC_TZC_I2S_CTRL_OFFSET (0x250)

/* 0x280 : tzc_sf_tzsrg_ctrl */
#define TZC_SEC_TZC_SF_TZSRG_CTRL_OFFSET   (0x280)
#define TZC_SEC_TZC_SF_TZSRG_R0_ID_EN      TZC_SEC_TZC_SF_TZSRG_R0_ID_EN
#define TZC_SEC_TZC_SF_TZSRG_R0_ID_EN_POS  (0U)
#define TZC_SEC_TZC_SF_TZSRG_R0_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_SF_TZSRG_R0_ID_EN_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_ID_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_R0_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_ID_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_R1_ID_EN      TZC_SEC_TZC_SF_TZSRG_R1_ID_EN
#define TZC_SEC_TZC_SF_TZSRG_R1_ID_EN_POS  (4U)
#define TZC_SEC_TZC_SF_TZSRG_R1_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_SF_TZSRG_R1_ID_EN_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_ID_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_R1_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_ID_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_R2_ID_EN      TZC_SEC_TZC_SF_TZSRG_R2_ID_EN
#define TZC_SEC_TZC_SF_TZSRG_R2_ID_EN_POS  (8U)
#define TZC_SEC_TZC_SF_TZSRG_R2_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_SF_TZSRG_R2_ID_EN_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_ID_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_R2_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_ID_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_R3_ID_EN      TZC_SEC_TZC_SF_TZSRG_R3_ID_EN
#define TZC_SEC_TZC_SF_TZSRG_R3_ID_EN_POS  (12U)
#define TZC_SEC_TZC_SF_TZSRG_R3_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_SF_TZSRG_R3_ID_EN_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R3_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_ID_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_R3_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R3_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_ID_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_RX_ID_EN      TZC_SEC_TZC_SF_TZSRG_RX_ID_EN
#define TZC_SEC_TZC_SF_TZSRG_RX_ID_EN_POS  (16U)
#define TZC_SEC_TZC_SF_TZSRG_RX_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_SF_TZSRG_RX_ID_EN_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_RX_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_RX_ID_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_RX_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_RX_ID_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_RX_ID_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_R0_EN         TZC_SEC_TZC_SF_TZSRG_R0_EN
#define TZC_SEC_TZC_SF_TZSRG_R0_EN_POS     (20U)
#define TZC_SEC_TZC_SF_TZSRG_R0_EN_LEN     (1U)
#define TZC_SEC_TZC_SF_TZSRG_R0_EN_MSK     (((1U << TZC_SEC_TZC_SF_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_R0_EN_UMSK    (~(((1U << TZC_SEC_TZC_SF_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_R1_EN         TZC_SEC_TZC_SF_TZSRG_R1_EN
#define TZC_SEC_TZC_SF_TZSRG_R1_EN_POS     (21U)
#define TZC_SEC_TZC_SF_TZSRG_R1_EN_LEN     (1U)
#define TZC_SEC_TZC_SF_TZSRG_R1_EN_MSK     (((1U << TZC_SEC_TZC_SF_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_R1_EN_UMSK    (~(((1U << TZC_SEC_TZC_SF_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_R2_EN         TZC_SEC_TZC_SF_TZSRG_R2_EN
#define TZC_SEC_TZC_SF_TZSRG_R2_EN_POS     (22U)
#define TZC_SEC_TZC_SF_TZSRG_R2_EN_LEN     (1U)
#define TZC_SEC_TZC_SF_TZSRG_R2_EN_MSK     (((1U << TZC_SEC_TZC_SF_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_R2_EN_UMSK    (~(((1U << TZC_SEC_TZC_SF_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_R3_EN         TZC_SEC_TZC_SF_TZSRG_R3_EN
#define TZC_SEC_TZC_SF_TZSRG_R3_EN_POS     (23U)
#define TZC_SEC_TZC_SF_TZSRG_R3_EN_LEN     (1U)
#define TZC_SEC_TZC_SF_TZSRG_R3_EN_MSK     (((1U << TZC_SEC_TZC_SF_TZSRG_R3_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_R3_EN_UMSK    (~(((1U << TZC_SEC_TZC_SF_TZSRG_R3_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_RX_EN         TZC_SEC_TZC_SF_TZSRG_RX_EN
#define TZC_SEC_TZC_SF_TZSRG_RX_EN_POS     (24U)
#define TZC_SEC_TZC_SF_TZSRG_RX_EN_LEN     (1U)
#define TZC_SEC_TZC_SF_TZSRG_RX_EN_MSK     (((1U << TZC_SEC_TZC_SF_TZSRG_RX_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_RX_EN_POS)
#define TZC_SEC_TZC_SF_TZSRG_RX_EN_UMSK    (~(((1U << TZC_SEC_TZC_SF_TZSRG_RX_EN_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_RX_EN_POS))
#define TZC_SEC_TZC_SF_TZSRG_R0_LOCK       TZC_SEC_TZC_SF_TZSRG_R0_LOCK
#define TZC_SEC_TZC_SF_TZSRG_R0_LOCK_POS   (25U)
#define TZC_SEC_TZC_SF_TZSRG_R0_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SF_TZSRG_R0_LOCK_MSK   (((1U << TZC_SEC_TZC_SF_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_LOCK_POS)
#define TZC_SEC_TZC_SF_TZSRG_R0_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SF_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_LOCK_POS))
#define TZC_SEC_TZC_SF_TZSRG_R1_LOCK       TZC_SEC_TZC_SF_TZSRG_R1_LOCK
#define TZC_SEC_TZC_SF_TZSRG_R1_LOCK_POS   (26U)
#define TZC_SEC_TZC_SF_TZSRG_R1_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SF_TZSRG_R1_LOCK_MSK   (((1U << TZC_SEC_TZC_SF_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_LOCK_POS)
#define TZC_SEC_TZC_SF_TZSRG_R1_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SF_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_LOCK_POS))
#define TZC_SEC_TZC_SF_TZSRG_R2_LOCK       TZC_SEC_TZC_SF_TZSRG_R2_LOCK
#define TZC_SEC_TZC_SF_TZSRG_R2_LOCK_POS   (27U)
#define TZC_SEC_TZC_SF_TZSRG_R2_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SF_TZSRG_R2_LOCK_MSK   (((1U << TZC_SEC_TZC_SF_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_LOCK_POS)
#define TZC_SEC_TZC_SF_TZSRG_R2_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SF_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_LOCK_POS))
#define TZC_SEC_TZC_SF_TZSRG_R3_LOCK       TZC_SEC_TZC_SF_TZSRG_R3_LOCK
#define TZC_SEC_TZC_SF_TZSRG_R3_LOCK_POS   (28U)
#define TZC_SEC_TZC_SF_TZSRG_R3_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SF_TZSRG_R3_LOCK_MSK   (((1U << TZC_SEC_TZC_SF_TZSRG_R3_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_LOCK_POS)
#define TZC_SEC_TZC_SF_TZSRG_R3_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SF_TZSRG_R3_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_LOCK_POS))
#define TZC_SEC_TZC_SF_TZSRG_RX_LOCK       TZC_SEC_TZC_SF_TZSRG_RX_LOCK
#define TZC_SEC_TZC_SF_TZSRG_RX_LOCK_POS   (29U)
#define TZC_SEC_TZC_SF_TZSRG_RX_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SF_TZSRG_RX_LOCK_MSK   (((1U << TZC_SEC_TZC_SF_TZSRG_RX_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_RX_LOCK_POS)
#define TZC_SEC_TZC_SF_TZSRG_RX_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SF_TZSRG_RX_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_RX_LOCK_POS))

/* 0x284 : tzc_sf_tzsrg_adr_mask */
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_OFFSET    (0x284)
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK           TZC_SEC_TZC_SF_TZSRG_ADR_MASK
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_POS       (0U)
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LEN       (19U)
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_MSK       (((1U << TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_ADR_MASK_POS)
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_UMSK      (~(((1U << TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_ADR_MASK_POS))
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK      TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK_POS  (31U)
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK_LEN  (1U)
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK_POS)
#define TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_ADR_MASK_LOCK_POS))

/* 0x288 : tzc_sf_tzsrg_r0 */
#define TZC_SEC_TZC_SF_TZSRG_R0_OFFSET     (0x288)
#define TZC_SEC_TZC_SF_TZSRG_R0_END        TZC_SEC_TZC_SF_TZSRG_R0_END
#define TZC_SEC_TZC_SF_TZSRG_R0_END_POS    (0U)
#define TZC_SEC_TZC_SF_TZSRG_R0_END_LEN    (16U)
#define TZC_SEC_TZC_SF_TZSRG_R0_END_MSK    (((1U << TZC_SEC_TZC_SF_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_END_POS)
#define TZC_SEC_TZC_SF_TZSRG_R0_END_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_END_POS))
#define TZC_SEC_TZC_SF_TZSRG_R0_START      TZC_SEC_TZC_SF_TZSRG_R0_START
#define TZC_SEC_TZC_SF_TZSRG_R0_START_POS  (16U)
#define TZC_SEC_TZC_SF_TZSRG_R0_START_LEN  (16U)
#define TZC_SEC_TZC_SF_TZSRG_R0_START_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_START_POS)
#define TZC_SEC_TZC_SF_TZSRG_R0_START_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_START_POS))

/* 0x28C : tzc_sf_tzsrg_r1 */
#define TZC_SEC_TZC_SF_TZSRG_R1_OFFSET     (0x28C)
#define TZC_SEC_TZC_SF_TZSRG_R1_END        TZC_SEC_TZC_SF_TZSRG_R1_END
#define TZC_SEC_TZC_SF_TZSRG_R1_END_POS    (0U)
#define TZC_SEC_TZC_SF_TZSRG_R1_END_LEN    (16U)
#define TZC_SEC_TZC_SF_TZSRG_R1_END_MSK    (((1U << TZC_SEC_TZC_SF_TZSRG_R1_END_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_END_POS)
#define TZC_SEC_TZC_SF_TZSRG_R1_END_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSRG_R1_END_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_END_POS))
#define TZC_SEC_TZC_SF_TZSRG_R1_START      TZC_SEC_TZC_SF_TZSRG_R1_START
#define TZC_SEC_TZC_SF_TZSRG_R1_START_POS  (16U)
#define TZC_SEC_TZC_SF_TZSRG_R1_START_LEN  (16U)
#define TZC_SEC_TZC_SF_TZSRG_R1_START_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R1_START_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_START_POS)
#define TZC_SEC_TZC_SF_TZSRG_R1_START_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R1_START_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_START_POS))

/* 0x290 : tzc_sf_tzsrg_r2 */
#define TZC_SEC_TZC_SF_TZSRG_R2_OFFSET     (0x290)
#define TZC_SEC_TZC_SF_TZSRG_R2_END        TZC_SEC_TZC_SF_TZSRG_R2_END
#define TZC_SEC_TZC_SF_TZSRG_R2_END_POS    (0U)
#define TZC_SEC_TZC_SF_TZSRG_R2_END_LEN    (16U)
#define TZC_SEC_TZC_SF_TZSRG_R2_END_MSK    (((1U << TZC_SEC_TZC_SF_TZSRG_R2_END_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_END_POS)
#define TZC_SEC_TZC_SF_TZSRG_R2_END_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSRG_R2_END_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_END_POS))
#define TZC_SEC_TZC_SF_TZSRG_R2_START      TZC_SEC_TZC_SF_TZSRG_R2_START
#define TZC_SEC_TZC_SF_TZSRG_R2_START_POS  (16U)
#define TZC_SEC_TZC_SF_TZSRG_R2_START_LEN  (16U)
#define TZC_SEC_TZC_SF_TZSRG_R2_START_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R2_START_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_START_POS)
#define TZC_SEC_TZC_SF_TZSRG_R2_START_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R2_START_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_START_POS))

