RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
/* 0x294 : tzc_sf_tzsrg_r3 */
#define TZC_SEC_TZC_SF_TZSRG_R3_OFFSET     (0x294)
#define TZC_SEC_TZC_SF_TZSRG_R3_END        TZC_SEC_TZC_SF_TZSRG_R3_END
#define TZC_SEC_TZC_SF_TZSRG_R3_END_POS    (0U)
#define TZC_SEC_TZC_SF_TZSRG_R3_END_LEN    (16U)
#define TZC_SEC_TZC_SF_TZSRG_R3_END_MSK    (((1U << TZC_SEC_TZC_SF_TZSRG_R3_END_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_END_POS)
#define TZC_SEC_TZC_SF_TZSRG_R3_END_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSRG_R3_END_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_END_POS))
#define TZC_SEC_TZC_SF_TZSRG_R3_START      TZC_SEC_TZC_SF_TZSRG_R3_START
#define TZC_SEC_TZC_SF_TZSRG_R3_START_POS  (16U)
#define TZC_SEC_TZC_SF_TZSRG_R3_START_LEN  (16U)
#define TZC_SEC_TZC_SF_TZSRG_R3_START_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R3_START_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_START_POS)
#define TZC_SEC_TZC_SF_TZSRG_R3_START_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R3_START_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_START_POS))

/* 0x298 : tzc_sf_tzsrg_msb */
#define TZC_SEC_TZC_SF_TZSRG_MSB_OFFSET        (0x298)
#define TZC_SEC_TZC_SF_TZSRG_R0_END_MSB        TZC_SEC_TZC_SF_TZSRG_R0_END_MSB
#define TZC_SEC_TZC_SF_TZSRG_R0_END_MSB_POS    (0U)
#define TZC_SEC_TZC_SF_TZSRG_R0_END_MSB_LEN    (3U)
#define TZC_SEC_TZC_SF_TZSRG_R0_END_MSB_MSK    (((1U << TZC_SEC_TZC_SF_TZSRG_R0_END_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_END_MSB_POS)
#define TZC_SEC_TZC_SF_TZSRG_R0_END_MSB_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSRG_R0_END_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_END_MSB_POS))
#define TZC_SEC_TZC_SF_TZSRG_R0_START_MSB      TZC_SEC_TZC_SF_TZSRG_R0_START_MSB
#define TZC_SEC_TZC_SF_TZSRG_R0_START_MSB_POS  (4U)
#define TZC_SEC_TZC_SF_TZSRG_R0_START_MSB_LEN  (3U)
#define TZC_SEC_TZC_SF_TZSRG_R0_START_MSB_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R0_START_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_START_MSB_POS)
#define TZC_SEC_TZC_SF_TZSRG_R0_START_MSB_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R0_START_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R0_START_MSB_POS))
#define TZC_SEC_TZC_SF_TZSRG_R1_END_MSB        TZC_SEC_TZC_SF_TZSRG_R1_END_MSB
#define TZC_SEC_TZC_SF_TZSRG_R1_END_MSB_POS    (8U)
#define TZC_SEC_TZC_SF_TZSRG_R1_END_MSB_LEN    (3U)
#define TZC_SEC_TZC_SF_TZSRG_R1_END_MSB_MSK    (((1U << TZC_SEC_TZC_SF_TZSRG_R1_END_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_END_MSB_POS)
#define TZC_SEC_TZC_SF_TZSRG_R1_END_MSB_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSRG_R1_END_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_END_MSB_POS))
#define TZC_SEC_TZC_SF_TZSRG_R1_START_MSB      TZC_SEC_TZC_SF_TZSRG_R1_START_MSB
#define TZC_SEC_TZC_SF_TZSRG_R1_START_MSB_POS  (12U)
#define TZC_SEC_TZC_SF_TZSRG_R1_START_MSB_LEN  (3U)
#define TZC_SEC_TZC_SF_TZSRG_R1_START_MSB_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R1_START_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_START_MSB_POS)
#define TZC_SEC_TZC_SF_TZSRG_R1_START_MSB_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R1_START_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R1_START_MSB_POS))
#define TZC_SEC_TZC_SF_TZSRG_R2_END_MSB        TZC_SEC_TZC_SF_TZSRG_R2_END_MSB
#define TZC_SEC_TZC_SF_TZSRG_R2_END_MSB_POS    (16U)
#define TZC_SEC_TZC_SF_TZSRG_R2_END_MSB_LEN    (3U)
#define TZC_SEC_TZC_SF_TZSRG_R2_END_MSB_MSK    (((1U << TZC_SEC_TZC_SF_TZSRG_R2_END_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_END_MSB_POS)
#define TZC_SEC_TZC_SF_TZSRG_R2_END_MSB_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSRG_R2_END_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_END_MSB_POS))
#define TZC_SEC_TZC_SF_TZSRG_R2_START_MSB      TZC_SEC_TZC_SF_TZSRG_R2_START_MSB
#define TZC_SEC_TZC_SF_TZSRG_R2_START_MSB_POS  (20U)
#define TZC_SEC_TZC_SF_TZSRG_R2_START_MSB_LEN  (3U)
#define TZC_SEC_TZC_SF_TZSRG_R2_START_MSB_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R2_START_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_START_MSB_POS)
#define TZC_SEC_TZC_SF_TZSRG_R2_START_MSB_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R2_START_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R2_START_MSB_POS))
#define TZC_SEC_TZC_SF_TZSRG_R3_END_MSB        TZC_SEC_TZC_SF_TZSRG_R3_END_MSB
#define TZC_SEC_TZC_SF_TZSRG_R3_END_MSB_POS    (24U)
#define TZC_SEC_TZC_SF_TZSRG_R3_END_MSB_LEN    (3U)
#define TZC_SEC_TZC_SF_TZSRG_R3_END_MSB_MSK    (((1U << TZC_SEC_TZC_SF_TZSRG_R3_END_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_END_MSB_POS)
#define TZC_SEC_TZC_SF_TZSRG_R3_END_MSB_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSRG_R3_END_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_END_MSB_POS))
#define TZC_SEC_TZC_SF_TZSRG_R3_START_MSB      TZC_SEC_TZC_SF_TZSRG_R3_START_MSB
#define TZC_SEC_TZC_SF_TZSRG_R3_START_MSB_POS  (28U)
#define TZC_SEC_TZC_SF_TZSRG_R3_START_MSB_LEN  (3U)
#define TZC_SEC_TZC_SF_TZSRG_R3_START_MSB_MSK  (((1U << TZC_SEC_TZC_SF_TZSRG_R3_START_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_START_MSB_POS)
#define TZC_SEC_TZC_SF_TZSRG_R3_START_MSB_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSRG_R3_START_MSB_LEN) - 1) << TZC_SEC_TZC_SF_TZSRG_R3_START_MSB_POS))

/* 0x300 : tzc_mm_bmx_tzmid */
#define TZC_SEC_TZC_MM_BMX_TZMID_OFFSET   (0x300)
#define TZC_SEC_TZC_MMCPU_TZMID           TZC_SEC_TZC_MMCPU_TZMID
#define TZC_SEC_TZC_MMCPU_TZMID_POS       (0U)
#define TZC_SEC_TZC_MMCPU_TZMID_LEN       (1U)
#define TZC_SEC_TZC_MMCPU_TZMID_MSK       (((1U << TZC_SEC_TZC_MMCPU_TZMID_LEN) - 1) << TZC_SEC_TZC_MMCPU_TZMID_POS)
#define TZC_SEC_TZC_MMCPU_TZMID_UMSK      (~(((1U << TZC_SEC_TZC_MMCPU_TZMID_LEN) - 1) << TZC_SEC_TZC_MMCPU_TZMID_POS))
#define TZC_SEC_TZC_BLAI_TZMID            TZC_SEC_TZC_BLAI_TZMID
#define TZC_SEC_TZC_BLAI_TZMID_POS        (1U)
#define TZC_SEC_TZC_BLAI_TZMID_LEN        (1U)
#define TZC_SEC_TZC_BLAI_TZMID_MSK        (((1U << TZC_SEC_TZC_BLAI_TZMID_LEN) - 1) << TZC_SEC_TZC_BLAI_TZMID_POS)
#define TZC_SEC_TZC_BLAI_TZMID_UMSK       (~(((1U << TZC_SEC_TZC_BLAI_TZMID_LEN) - 1) << TZC_SEC_TZC_BLAI_TZMID_POS))
#define TZC_SEC_TZC_CODEC_TZMID           TZC_SEC_TZC_CODEC_TZMID
#define TZC_SEC_TZC_CODEC_TZMID_POS       (2U)
#define TZC_SEC_TZC_CODEC_TZMID_LEN       (1U)
#define TZC_SEC_TZC_CODEC_TZMID_MSK       (((1U << TZC_SEC_TZC_CODEC_TZMID_LEN) - 1) << TZC_SEC_TZC_CODEC_TZMID_POS)
#define TZC_SEC_TZC_CODEC_TZMID_UMSK      (~(((1U << TZC_SEC_TZC_CODEC_TZMID_LEN) - 1) << TZC_SEC_TZC_CODEC_TZMID_POS))
#define TZC_SEC_TZC_SUBSYS_TZMID          TZC_SEC_TZC_SUBSYS_TZMID
#define TZC_SEC_TZC_SUBSYS_TZMID_POS      (3U)
#define TZC_SEC_TZC_SUBSYS_TZMID_LEN      (1U)
#define TZC_SEC_TZC_SUBSYS_TZMID_MSK      (((1U << TZC_SEC_TZC_SUBSYS_TZMID_LEN) - 1) << TZC_SEC_TZC_SUBSYS_TZMID_POS)
#define TZC_SEC_TZC_SUBSYS_TZMID_UMSK     (~(((1U << TZC_SEC_TZC_SUBSYS_TZMID_LEN) - 1) << TZC_SEC_TZC_SUBSYS_TZMID_POS))
#define TZC_SEC_TZC_X2DDMA_TZMID          TZC_SEC_TZC_X2DDMA_TZMID
#define TZC_SEC_TZC_X2DDMA_TZMID_POS      (4U)
#define TZC_SEC_TZC_X2DDMA_TZMID_LEN      (1U)
#define TZC_SEC_TZC_X2DDMA_TZMID_MSK      (((1U << TZC_SEC_TZC_X2DDMA_TZMID_LEN) - 1) << TZC_SEC_TZC_X2DDMA_TZMID_POS)
#define TZC_SEC_TZC_X2DDMA_TZMID_UMSK     (~(((1U << TZC_SEC_TZC_X2DDMA_TZMID_LEN) - 1) << TZC_SEC_TZC_X2DDMA_TZMID_POS))
#define TZC_SEC_TZC_XDMA_TZMID            TZC_SEC_TZC_XDMA_TZMID
#define TZC_SEC_TZC_XDMA_TZMID_POS        (5U)
#define TZC_SEC_TZC_XDMA_TZMID_LEN        (1U)
#define TZC_SEC_TZC_XDMA_TZMID_MSK        (((1U << TZC_SEC_TZC_XDMA_TZMID_LEN) - 1) << TZC_SEC_TZC_XDMA_TZMID_POS)
#define TZC_SEC_TZC_XDMA_TZMID_UMSK       (~(((1U << TZC_SEC_TZC_XDMA_TZMID_LEN) - 1) << TZC_SEC_TZC_XDMA_TZMID_POS))
#define TZC_SEC_TZC_MMCPU_TZMID_SEL       TZC_SEC_TZC_MMCPU_TZMID_SEL
#define TZC_SEC_TZC_MMCPU_TZMID_SEL_POS   (16U)
#define TZC_SEC_TZC_MMCPU_TZMID_SEL_LEN   (1U)
#define TZC_SEC_TZC_MMCPU_TZMID_SEL_MSK   (((1U << TZC_SEC_TZC_MMCPU_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_MMCPU_TZMID_SEL_POS)
#define TZC_SEC_TZC_MMCPU_TZMID_SEL_UMSK  (~(((1U << TZC_SEC_TZC_MMCPU_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_MMCPU_TZMID_SEL_POS))
#define TZC_SEC_TZC_BLAI_TZMID_SEL        TZC_SEC_TZC_BLAI_TZMID_SEL
#define TZC_SEC_TZC_BLAI_TZMID_SEL_POS    (17U)
#define TZC_SEC_TZC_BLAI_TZMID_SEL_LEN    (1U)
#define TZC_SEC_TZC_BLAI_TZMID_SEL_MSK    (((1U << TZC_SEC_TZC_BLAI_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_BLAI_TZMID_SEL_POS)
#define TZC_SEC_TZC_BLAI_TZMID_SEL_UMSK   (~(((1U << TZC_SEC_TZC_BLAI_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_BLAI_TZMID_SEL_POS))
#define TZC_SEC_TZC_CODEC_TZMID_SEL       TZC_SEC_TZC_CODEC_TZMID_SEL
#define TZC_SEC_TZC_CODEC_TZMID_SEL_POS   (18U)
#define TZC_SEC_TZC_CODEC_TZMID_SEL_LEN   (1U)
#define TZC_SEC_TZC_CODEC_TZMID_SEL_MSK   (((1U << TZC_SEC_TZC_CODEC_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_CODEC_TZMID_SEL_POS)
#define TZC_SEC_TZC_CODEC_TZMID_SEL_UMSK  (~(((1U << TZC_SEC_TZC_CODEC_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_CODEC_TZMID_SEL_POS))
#define TZC_SEC_TZC_SUBSYS_TZMID_SEL      TZC_SEC_TZC_SUBSYS_TZMID_SEL
#define TZC_SEC_TZC_SUBSYS_TZMID_SEL_POS  (19U)
#define TZC_SEC_TZC_SUBSYS_TZMID_SEL_LEN  (1U)
#define TZC_SEC_TZC_SUBSYS_TZMID_SEL_MSK  (((1U << TZC_SEC_TZC_SUBSYS_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_SUBSYS_TZMID_SEL_POS)
#define TZC_SEC_TZC_SUBSYS_TZMID_SEL_UMSK (~(((1U << TZC_SEC_TZC_SUBSYS_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_SUBSYS_TZMID_SEL_POS))
#define TZC_SEC_TZC_X2DDMA_TZMID_SEL      TZC_SEC_TZC_X2DDMA_TZMID_SEL
#define TZC_SEC_TZC_X2DDMA_TZMID_SEL_POS  (20U)
#define TZC_SEC_TZC_X2DDMA_TZMID_SEL_LEN  (1U)
#define TZC_SEC_TZC_X2DDMA_TZMID_SEL_MSK  (((1U << TZC_SEC_TZC_X2DDMA_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_X2DDMA_TZMID_SEL_POS)
#define TZC_SEC_TZC_X2DDMA_TZMID_SEL_UMSK (~(((1U << TZC_SEC_TZC_X2DDMA_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_X2DDMA_TZMID_SEL_POS))
#define TZC_SEC_TZC_XDMA_TZMID_SEL        TZC_SEC_TZC_XDMA_TZMID_SEL
#define TZC_SEC_TZC_XDMA_TZMID_SEL_POS    (21U)
#define TZC_SEC_TZC_XDMA_TZMID_SEL_LEN    (1U)
#define TZC_SEC_TZC_XDMA_TZMID_SEL_MSK    (((1U << TZC_SEC_TZC_XDMA_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_XDMA_TZMID_SEL_POS)
#define TZC_SEC_TZC_XDMA_TZMID_SEL_UMSK   (~(((1U << TZC_SEC_TZC_XDMA_TZMID_SEL_LEN) - 1) << TZC_SEC_TZC_XDMA_TZMID_SEL_POS))

