RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
/* 0x304 : tzc_mm_bmx_tzmid_lock */
#define TZC_SEC_TZC_MM_BMX_TZMID_LOCK_OFFSET (0x304)
#define TZC_SEC_TZC_MMCPU_TZMID_LOCK         TZC_SEC_TZC_MMCPU_TZMID_LOCK
#define TZC_SEC_TZC_MMCPU_TZMID_LOCK_POS     (0U)
#define TZC_SEC_TZC_MMCPU_TZMID_LOCK_LEN     (1U)
#define TZC_SEC_TZC_MMCPU_TZMID_LOCK_MSK     (((1U << TZC_SEC_TZC_MMCPU_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMCPU_TZMID_LOCK_POS)
#define TZC_SEC_TZC_MMCPU_TZMID_LOCK_UMSK    (~(((1U << TZC_SEC_TZC_MMCPU_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMCPU_TZMID_LOCK_POS))
#define TZC_SEC_TZC_BLAI_TZMID_LOCK          TZC_SEC_TZC_BLAI_TZMID_LOCK
#define TZC_SEC_TZC_BLAI_TZMID_LOCK_POS      (1U)
#define TZC_SEC_TZC_BLAI_TZMID_LOCK_LEN      (1U)
#define TZC_SEC_TZC_BLAI_TZMID_LOCK_MSK      (((1U << TZC_SEC_TZC_BLAI_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_BLAI_TZMID_LOCK_POS)
#define TZC_SEC_TZC_BLAI_TZMID_LOCK_UMSK     (~(((1U << TZC_SEC_TZC_BLAI_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_BLAI_TZMID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_TZMID_LOCK         TZC_SEC_TZC_CODEC_TZMID_LOCK
#define TZC_SEC_TZC_CODEC_TZMID_LOCK_POS     (2U)
#define TZC_SEC_TZC_CODEC_TZMID_LOCK_LEN     (1U)
#define TZC_SEC_TZC_CODEC_TZMID_LOCK_MSK     (((1U << TZC_SEC_TZC_CODEC_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_TZMID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_TZMID_LOCK_UMSK    (~(((1U << TZC_SEC_TZC_CODEC_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_TZMID_LOCK_POS))
#define TZC_SEC_TZC_SUBSYS_TZMID_LOCK        TZC_SEC_TZC_SUBSYS_TZMID_LOCK
#define TZC_SEC_TZC_SUBSYS_TZMID_LOCK_POS    (3U)
#define TZC_SEC_TZC_SUBSYS_TZMID_LOCK_LEN    (1U)
#define TZC_SEC_TZC_SUBSYS_TZMID_LOCK_MSK    (((1U << TZC_SEC_TZC_SUBSYS_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_SUBSYS_TZMID_LOCK_POS)
#define TZC_SEC_TZC_SUBSYS_TZMID_LOCK_UMSK   (~(((1U << TZC_SEC_TZC_SUBSYS_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_SUBSYS_TZMID_LOCK_POS))
#define TZC_SEC_TZC_X2DDMA_TZMID_LOCK        TZC_SEC_TZC_X2DDMA_TZMID_LOCK
#define TZC_SEC_TZC_X2DDMA_TZMID_LOCK_POS    (4U)
#define TZC_SEC_TZC_X2DDMA_TZMID_LOCK_LEN    (1U)
#define TZC_SEC_TZC_X2DDMA_TZMID_LOCK_MSK    (((1U << TZC_SEC_TZC_X2DDMA_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_X2DDMA_TZMID_LOCK_POS)
#define TZC_SEC_TZC_X2DDMA_TZMID_LOCK_UMSK   (~(((1U << TZC_SEC_TZC_X2DDMA_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_X2DDMA_TZMID_LOCK_POS))
#define TZC_SEC_TZC_XDMA_TZMID_LOCK          TZC_SEC_TZC_XDMA_TZMID_LOCK
#define TZC_SEC_TZC_XDMA_TZMID_LOCK_POS      (5U)
#define TZC_SEC_TZC_XDMA_TZMID_LOCK_LEN      (1U)
#define TZC_SEC_TZC_XDMA_TZMID_LOCK_MSK      (((1U << TZC_SEC_TZC_XDMA_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_XDMA_TZMID_LOCK_POS)
#define TZC_SEC_TZC_XDMA_TZMID_LOCK_UMSK     (~(((1U << TZC_SEC_TZC_XDMA_TZMID_LOCK_LEN) - 1) << TZC_SEC_TZC_XDMA_TZMID_LOCK_POS))

/* 0x308 : tzc_mm_bmx_s0 */
#define TZC_SEC_TZC_MM_BMX_S0_OFFSET         (0x308)
#define TZC_SEC_TZC_MMPERI_S10_TZSID_EN      TZC_SEC_TZC_MMPERI_S10_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S10_TZSID_EN_POS  (0U)
#define TZC_SEC_TZC_MMPERI_S10_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S10_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S10_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S10_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S10_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S10_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S10_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S11_TZSID_EN      TZC_SEC_TZC_MMPERI_S11_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S11_TZSID_EN_POS  (2U)
#define TZC_SEC_TZC_MMPERI_S11_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S11_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S11_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S11_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S11_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S11_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S11_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S12_TZSID_EN      TZC_SEC_TZC_MMPERI_S12_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S12_TZSID_EN_POS  (4U)
#define TZC_SEC_TZC_MMPERI_S12_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S12_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S12_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S12_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S12_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S12_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S12_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S13_TZSID_EN      TZC_SEC_TZC_MMPERI_S13_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S13_TZSID_EN_POS  (6U)
#define TZC_SEC_TZC_MMPERI_S13_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S13_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S13_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S13_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S13_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S13_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S13_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S14_TZSID_EN      TZC_SEC_TZC_MMPERI_S14_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S14_TZSID_EN_POS  (8U)
#define TZC_SEC_TZC_MMPERI_S14_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S14_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S14_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S14_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S14_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S14_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S14_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S15_TZSID_EN      TZC_SEC_TZC_MMPERI_S15_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S15_TZSID_EN_POS  (10U)
#define TZC_SEC_TZC_MMPERI_S15_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S15_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S15_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S15_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S15_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S15_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S15_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S16_TZSID_EN      TZC_SEC_TZC_MMPERI_S16_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S16_TZSID_EN_POS  (12U)
#define TZC_SEC_TZC_MMPERI_S16_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S16_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S16_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S16_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S16_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S16_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S16_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S17_TZSID_EN      TZC_SEC_TZC_MMPERI_S17_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S17_TZSID_EN_POS  (14U)
#define TZC_SEC_TZC_MMPERI_S17_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S17_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S17_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S17_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S17_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S17_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S17_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S18_TZSID_EN      TZC_SEC_TZC_MMPERI_S18_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S18_TZSID_EN_POS  (16U)
#define TZC_SEC_TZC_MMPERI_S18_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S18_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S18_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S18_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S18_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S18_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S18_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S19_TZSID_EN      TZC_SEC_TZC_MMPERI_S19_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S19_TZSID_EN_POS  (18U)
#define TZC_SEC_TZC_MMPERI_S19_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S19_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S19_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S19_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S19_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S19_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S19_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_EN      TZC_SEC_TZC_MMPERI_S1A_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_EN_POS  (20U)
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1A_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1A_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_EN      TZC_SEC_TZC_MMPERI_S1B_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_EN_POS  (22U)
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1B_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1B_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_EN      TZC_SEC_TZC_MMPERI_S1C_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_EN_POS  (24U)
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1C_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1C_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_EN      TZC_SEC_TZC_MMPERI_S1D_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_EN_POS  (26U)
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1D_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1D_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_EN      TZC_SEC_TZC_MMPERI_S1E_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_EN_POS  (28U)
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1E_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1E_TZSID_EN_POS))
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_EN      TZC_SEC_TZC_MMPERI_S1F_TZSID_EN
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_EN_POS  (30U)
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1F_TZSID_EN_POS)
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1F_TZSID_EN_POS))

/* 0x30C : tzc_mm_bmx_s1 */
#define TZC_SEC_TZC_MM_BMX_S1_OFFSET  (0x30C)
#define TZC_SEC_TZC_S10_TZSID_EN      TZC_SEC_TZC_S10_TZSID_EN
#define TZC_SEC_TZC_S10_TZSID_EN_POS  (0U)
#define TZC_SEC_TZC_S10_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S10_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S10_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S10_TZSID_EN_POS)
#define TZC_SEC_TZC_S10_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S10_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S10_TZSID_EN_POS))
#define TZC_SEC_TZC_S11_TZSID_EN      TZC_SEC_TZC_S11_TZSID_EN
#define TZC_SEC_TZC_S11_TZSID_EN_POS  (2U)
#define TZC_SEC_TZC_S11_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S11_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S11_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S11_TZSID_EN_POS)
#define TZC_SEC_TZC_S11_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S11_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S11_TZSID_EN_POS))
#define TZC_SEC_TZC_S12_TZSID_EN      TZC_SEC_TZC_S12_TZSID_EN
#define TZC_SEC_TZC_S12_TZSID_EN_POS  (4U)
#define TZC_SEC_TZC_S12_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S12_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S12_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S12_TZSID_EN_POS)
#define TZC_SEC_TZC_S12_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S12_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S12_TZSID_EN_POS))
#define TZC_SEC_TZC_S13_TZSID_EN      TZC_SEC_TZC_S13_TZSID_EN
#define TZC_SEC_TZC_S13_TZSID_EN_POS  (6U)
#define TZC_SEC_TZC_S13_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S13_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S13_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S13_TZSID_EN_POS)
#define TZC_SEC_TZC_S13_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S13_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S13_TZSID_EN_POS))
#define TZC_SEC_TZC_S14_TZSID_EN      TZC_SEC_TZC_S14_TZSID_EN
#define TZC_SEC_TZC_S14_TZSID_EN_POS  (8U)
#define TZC_SEC_TZC_S14_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S14_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S14_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S14_TZSID_EN_POS)
#define TZC_SEC_TZC_S14_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S14_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S14_TZSID_EN_POS))
#define TZC_SEC_TZC_S15_TZSID_EN      TZC_SEC_TZC_S15_TZSID_EN
#define TZC_SEC_TZC_S15_TZSID_EN_POS  (10U)
#define TZC_SEC_TZC_S15_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S15_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S15_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S15_TZSID_EN_POS)
#define TZC_SEC_TZC_S15_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S15_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S15_TZSID_EN_POS))
#define TZC_SEC_TZC_S16_TZSID_EN      TZC_SEC_TZC_S16_TZSID_EN
#define TZC_SEC_TZC_S16_TZSID_EN_POS  (12U)
#define TZC_SEC_TZC_S16_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S16_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S16_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S16_TZSID_EN_POS)
#define TZC_SEC_TZC_S16_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S16_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S16_TZSID_EN_POS))
#define TZC_SEC_TZC_S17_TZSID_EN      TZC_SEC_TZC_S17_TZSID_EN
#define TZC_SEC_TZC_S17_TZSID_EN_POS  (14U)
#define TZC_SEC_TZC_S17_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S17_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S17_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S17_TZSID_EN_POS)
#define TZC_SEC_TZC_S17_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S17_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S17_TZSID_EN_POS))
#define TZC_SEC_TZC_S18_TZSID_EN      TZC_SEC_TZC_S18_TZSID_EN
#define TZC_SEC_TZC_S18_TZSID_EN_POS  (16U)
#define TZC_SEC_TZC_S18_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S18_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S18_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S18_TZSID_EN_POS)
#define TZC_SEC_TZC_S18_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S18_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S18_TZSID_EN_POS))
#define TZC_SEC_TZC_S19_TZSID_EN      TZC_SEC_TZC_S19_TZSID_EN
#define TZC_SEC_TZC_S19_TZSID_EN_POS  (18U)
#define TZC_SEC_TZC_S19_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S19_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S19_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S19_TZSID_EN_POS)
#define TZC_SEC_TZC_S19_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S19_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S19_TZSID_EN_POS))
#define TZC_SEC_TZC_S1A_TZSID_EN      TZC_SEC_TZC_S1A_TZSID_EN
#define TZC_SEC_TZC_S1A_TZSID_EN_POS  (20U)
#define TZC_SEC_TZC_S1A_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S1A_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S1A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1A_TZSID_EN_POS)
#define TZC_SEC_TZC_S1A_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S1A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1A_TZSID_EN_POS))
#define TZC_SEC_TZC_S1B_TZSID_EN      TZC_SEC_TZC_S1B_TZSID_EN
#define TZC_SEC_TZC_S1B_TZSID_EN_POS  (22U)
#define TZC_SEC_TZC_S1B_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S1B_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S1B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1B_TZSID_EN_POS)
#define TZC_SEC_TZC_S1B_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S1B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1B_TZSID_EN_POS))
#define TZC_SEC_TZC_S1C_TZSID_EN      TZC_SEC_TZC_S1C_TZSID_EN
#define TZC_SEC_TZC_S1C_TZSID_EN_POS  (24U)
#define TZC_SEC_TZC_S1C_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S1C_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S1C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1C_TZSID_EN_POS)
#define TZC_SEC_TZC_S1C_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S1C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1C_TZSID_EN_POS))
#define TZC_SEC_TZC_S1D_TZSID_EN      TZC_SEC_TZC_S1D_TZSID_EN
#define TZC_SEC_TZC_S1D_TZSID_EN_POS  (26U)
#define TZC_SEC_TZC_S1D_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S1D_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S1D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1D_TZSID_EN_POS)
#define TZC_SEC_TZC_S1D_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S1D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1D_TZSID_EN_POS))
#define TZC_SEC_TZC_S1E_TZSID_EN      TZC_SEC_TZC_S1E_TZSID_EN
#define TZC_SEC_TZC_S1E_TZSID_EN_POS  (28U)
#define TZC_SEC_TZC_S1E_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S1E_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S1E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1E_TZSID_EN_POS)
#define TZC_SEC_TZC_S1E_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S1E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1E_TZSID_EN_POS))
#define TZC_SEC_TZC_S1F_TZSID_EN      TZC_SEC_TZC_S1F_TZSID_EN
#define TZC_SEC_TZC_S1F_TZSID_EN_POS  (30U)
#define TZC_SEC_TZC_S1F_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_S1F_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_S1F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1F_TZSID_EN_POS)
#define TZC_SEC_TZC_S1F_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_S1F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_S1F_TZSID_EN_POS))

/* 0x310 : tzc_mm_bmx_s2 */
#define TZC_SEC_TZC_MM_BMX_S2_OFFSET        (0x310)
#define TZC_SEC_TZC_CODEC_S10_TZSID_EN      TZC_SEC_TZC_CODEC_S10_TZSID_EN
#define TZC_SEC_TZC_CODEC_S10_TZSID_EN_POS  (0U)
#define TZC_SEC_TZC_CODEC_S10_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S10_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S10_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S10_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S10_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S10_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S10_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S11_TZSID_EN      TZC_SEC_TZC_CODEC_S11_TZSID_EN
#define TZC_SEC_TZC_CODEC_S11_TZSID_EN_POS  (2U)
#define TZC_SEC_TZC_CODEC_S11_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S11_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S11_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S11_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S11_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S11_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S11_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S12_TZSID_EN      TZC_SEC_TZC_CODEC_S12_TZSID_EN
#define TZC_SEC_TZC_CODEC_S12_TZSID_EN_POS  (4U)
#define TZC_SEC_TZC_CODEC_S12_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S12_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S12_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S12_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S12_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S12_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S12_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S13_TZSID_EN      TZC_SEC_TZC_CODEC_S13_TZSID_EN
#define TZC_SEC_TZC_CODEC_S13_TZSID_EN_POS  (6U)
#define TZC_SEC_TZC_CODEC_S13_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S13_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S13_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S13_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S13_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S13_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S13_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S14_TZSID_EN      TZC_SEC_TZC_CODEC_S14_TZSID_EN
#define TZC_SEC_TZC_CODEC_S14_TZSID_EN_POS  (8U)
#define TZC_SEC_TZC_CODEC_S14_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S14_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S14_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S14_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S14_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S14_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S14_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S15_TZSID_EN      TZC_SEC_TZC_CODEC_S15_TZSID_EN
#define TZC_SEC_TZC_CODEC_S15_TZSID_EN_POS  (10U)
#define TZC_SEC_TZC_CODEC_S15_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S15_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S15_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S15_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S15_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S15_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S15_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S16_TZSID_EN      TZC_SEC_TZC_CODEC_S16_TZSID_EN
#define TZC_SEC_TZC_CODEC_S16_TZSID_EN_POS  (12U)
#define TZC_SEC_TZC_CODEC_S16_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S16_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S16_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S16_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S16_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S16_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S16_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S17_TZSID_EN      TZC_SEC_TZC_CODEC_S17_TZSID_EN
#define TZC_SEC_TZC_CODEC_S17_TZSID_EN_POS  (14U)
#define TZC_SEC_TZC_CODEC_S17_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S17_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S17_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S17_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S17_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S17_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S17_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S18_TZSID_EN      TZC_SEC_TZC_CODEC_S18_TZSID_EN
#define TZC_SEC_TZC_CODEC_S18_TZSID_EN_POS  (16U)
#define TZC_SEC_TZC_CODEC_S18_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S18_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S18_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S18_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S18_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S18_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S18_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S19_TZSID_EN      TZC_SEC_TZC_CODEC_S19_TZSID_EN
#define TZC_SEC_TZC_CODEC_S19_TZSID_EN_POS  (18U)
#define TZC_SEC_TZC_CODEC_S19_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S19_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S19_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S19_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S19_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S19_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S19_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S1A_TZSID_EN      TZC_SEC_TZC_CODEC_S1A_TZSID_EN
#define TZC_SEC_TZC_CODEC_S1A_TZSID_EN_POS  (20U)
#define TZC_SEC_TZC_CODEC_S1A_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S1A_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S1A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1A_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S1A_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1A_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1A_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S1B_TZSID_EN      TZC_SEC_TZC_CODEC_S1B_TZSID_EN
#define TZC_SEC_TZC_CODEC_S1B_TZSID_EN_POS  (22U)
#define TZC_SEC_TZC_CODEC_S1B_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S1B_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S1B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1B_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S1B_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1B_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1B_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S1C_TZSID_EN      TZC_SEC_TZC_CODEC_S1C_TZSID_EN
#define TZC_SEC_TZC_CODEC_S1C_TZSID_EN_POS  (24U)
#define TZC_SEC_TZC_CODEC_S1C_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S1C_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S1C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1C_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S1C_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1C_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1C_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S1D_TZSID_EN      TZC_SEC_TZC_CODEC_S1D_TZSID_EN
#define TZC_SEC_TZC_CODEC_S1D_TZSID_EN_POS  (26U)
#define TZC_SEC_TZC_CODEC_S1D_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S1D_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S1D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1D_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S1D_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1D_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1D_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S1E_TZSID_EN      TZC_SEC_TZC_CODEC_S1E_TZSID_EN
#define TZC_SEC_TZC_CODEC_S1E_TZSID_EN_POS  (28U)
#define TZC_SEC_TZC_CODEC_S1E_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S1E_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S1E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1E_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S1E_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1E_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1E_TZSID_EN_POS))
#define TZC_SEC_TZC_CODEC_S1F_TZSID_EN      TZC_SEC_TZC_CODEC_S1F_TZSID_EN
#define TZC_SEC_TZC_CODEC_S1F_TZSID_EN_POS  (30U)
#define TZC_SEC_TZC_CODEC_S1F_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_CODEC_S1F_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_CODEC_S1F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1F_TZSID_EN_POS)
#define TZC_SEC_TZC_CODEC_S1F_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1F_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_CODEC_S1F_TZSID_EN_POS))

