RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
/* 0x314 : tzc_mm_bmx_s_lock0 */
#define TZC_SEC_TZC_MM_BMX_S_LOCK0_OFFSET      (0x314)
#define TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK_POS  (0U)
#define TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S10_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK_POS  (1U)
#define TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S11_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK_POS  (2U)
#define TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S12_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK_POS  (3U)
#define TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S13_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK_POS  (4U)
#define TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S14_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK_POS  (5U)
#define TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S15_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK_POS  (6U)
#define TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S16_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK_POS  (7U)
#define TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S17_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK_POS  (8U)
#define TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S18_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK_POS  (9U)
#define TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S19_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK_POS  (10U)
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1A_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK_POS  (11U)
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1B_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK_POS  (12U)
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1C_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK_POS  (13U)
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1D_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK_POS  (14U)
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1E_TZSID_LOCK_POS))
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK      TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK_POS  (15U)
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK_POS)
#define TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_MMPERI_S1F_TZSID_LOCK_POS))

/* 0x318 : tzc_mm_bmx_s_lock1 */
#define TZC_SEC_TZC_MM_BMX_S_LOCK1_OFFSET     (0x318)
#define TZC_SEC_TZC_CODEC_S10_TZSID_LOCK      TZC_SEC_TZC_CODEC_S10_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S10_TZSID_LOCK_POS  (0U)
#define TZC_SEC_TZC_CODEC_S10_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S10_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S10_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S10_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S10_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S10_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S10_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S11_TZSID_LOCK      TZC_SEC_TZC_CODEC_S11_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S11_TZSID_LOCK_POS  (1U)
#define TZC_SEC_TZC_CODEC_S11_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S11_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S11_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S11_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S11_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S11_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S11_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S12_TZSID_LOCK      TZC_SEC_TZC_CODEC_S12_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S12_TZSID_LOCK_POS  (2U)
#define TZC_SEC_TZC_CODEC_S12_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S12_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S12_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S12_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S12_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S12_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S12_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S13_TZSID_LOCK      TZC_SEC_TZC_CODEC_S13_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S13_TZSID_LOCK_POS  (3U)
#define TZC_SEC_TZC_CODEC_S13_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S13_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S13_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S13_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S13_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S13_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S13_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S14_TZSID_LOCK      TZC_SEC_TZC_CODEC_S14_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S14_TZSID_LOCK_POS  (4U)
#define TZC_SEC_TZC_CODEC_S14_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S14_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S14_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S14_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S14_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S14_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S14_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S15_TZSID_LOCK      TZC_SEC_TZC_CODEC_S15_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S15_TZSID_LOCK_POS  (5U)
#define TZC_SEC_TZC_CODEC_S15_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S15_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S15_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S15_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S15_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S15_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S15_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S16_TZSID_LOCK      TZC_SEC_TZC_CODEC_S16_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S16_TZSID_LOCK_POS  (6U)
#define TZC_SEC_TZC_CODEC_S16_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S16_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S16_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S16_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S16_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S16_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S16_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S17_TZSID_LOCK      TZC_SEC_TZC_CODEC_S17_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S17_TZSID_LOCK_POS  (7U)
#define TZC_SEC_TZC_CODEC_S17_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S17_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S17_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S17_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S17_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S17_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S17_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S18_TZSID_LOCK      TZC_SEC_TZC_CODEC_S18_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S18_TZSID_LOCK_POS  (8U)
#define TZC_SEC_TZC_CODEC_S18_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S18_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S18_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S18_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S18_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S18_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S18_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S19_TZSID_LOCK      TZC_SEC_TZC_CODEC_S19_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S19_TZSID_LOCK_POS  (9U)
#define TZC_SEC_TZC_CODEC_S19_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S19_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S19_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S19_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S19_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S19_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S19_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK      TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK_POS  (10U)
#define TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1A_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK      TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK_POS  (11U)
#define TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1B_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK      TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK_POS  (12U)
#define TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1C_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK      TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK_POS  (13U)
#define TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1D_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK      TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK_POS  (14U)
#define TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1E_TZSID_LOCK_POS))
#define TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK      TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK
#define TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK_POS  (15U)
#define TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK_POS)
#define TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_CODEC_S1F_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S10_TZSID_LOCK            TZC_SEC_TZC_S10_TZSID_LOCK
#define TZC_SEC_TZC_S10_TZSID_LOCK_POS        (16U)
#define TZC_SEC_TZC_S10_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S10_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S10_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S10_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S10_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S10_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S10_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S11_TZSID_LOCK            TZC_SEC_TZC_S11_TZSID_LOCK
#define TZC_SEC_TZC_S11_TZSID_LOCK_POS        (17U)
#define TZC_SEC_TZC_S11_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S11_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S11_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S11_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S11_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S11_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S11_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S12_TZSID_LOCK            TZC_SEC_TZC_S12_TZSID_LOCK
#define TZC_SEC_TZC_S12_TZSID_LOCK_POS        (18U)
#define TZC_SEC_TZC_S12_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S12_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S12_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S12_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S12_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S12_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S12_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S13_TZSID_LOCK            TZC_SEC_TZC_S13_TZSID_LOCK
#define TZC_SEC_TZC_S13_TZSID_LOCK_POS        (19U)
#define TZC_SEC_TZC_S13_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S13_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S13_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S13_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S13_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S13_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S13_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S14_TZSID_LOCK            TZC_SEC_TZC_S14_TZSID_LOCK
#define TZC_SEC_TZC_S14_TZSID_LOCK_POS        (20U)
#define TZC_SEC_TZC_S14_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S14_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S14_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S14_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S14_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S14_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S14_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S15_TZSID_LOCK            TZC_SEC_TZC_S15_TZSID_LOCK
#define TZC_SEC_TZC_S15_TZSID_LOCK_POS        (21U)
#define TZC_SEC_TZC_S15_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S15_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S15_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S15_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S15_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S15_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S15_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S16_TZSID_LOCK            TZC_SEC_TZC_S16_TZSID_LOCK
#define TZC_SEC_TZC_S16_TZSID_LOCK_POS        (22U)
#define TZC_SEC_TZC_S16_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S16_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S16_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S16_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S16_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S16_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S16_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S17_TZSID_LOCK            TZC_SEC_TZC_S17_TZSID_LOCK
#define TZC_SEC_TZC_S17_TZSID_LOCK_POS        (23U)
#define TZC_SEC_TZC_S17_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S17_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S17_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S17_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S17_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S17_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S17_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S18_TZSID_LOCK            TZC_SEC_TZC_S18_TZSID_LOCK
#define TZC_SEC_TZC_S18_TZSID_LOCK_POS        (24U)
#define TZC_SEC_TZC_S18_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S18_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S18_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S18_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S18_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S18_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S18_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S19_TZSID_LOCK            TZC_SEC_TZC_S19_TZSID_LOCK
#define TZC_SEC_TZC_S19_TZSID_LOCK_POS        (25U)
#define TZC_SEC_TZC_S19_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S19_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S19_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S19_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S19_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S19_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S19_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S1A_TZSID_LOCK            TZC_SEC_TZC_S1A_TZSID_LOCK
#define TZC_SEC_TZC_S1A_TZSID_LOCK_POS        (26U)
#define TZC_SEC_TZC_S1A_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S1A_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S1A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1A_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S1A_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S1A_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1A_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S1B_TZSID_LOCK            TZC_SEC_TZC_S1B_TZSID_LOCK
#define TZC_SEC_TZC_S1B_TZSID_LOCK_POS        (27U)
#define TZC_SEC_TZC_S1B_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S1B_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S1B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1B_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S1B_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S1B_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1B_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S1C_TZSID_LOCK            TZC_SEC_TZC_S1C_TZSID_LOCK
#define TZC_SEC_TZC_S1C_TZSID_LOCK_POS        (28U)
#define TZC_SEC_TZC_S1C_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S1C_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S1C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1C_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S1C_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S1C_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1C_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S1D_TZSID_LOCK            TZC_SEC_TZC_S1D_TZSID_LOCK
#define TZC_SEC_TZC_S1D_TZSID_LOCK_POS        (29U)
#define TZC_SEC_TZC_S1D_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S1D_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S1D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1D_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S1D_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S1D_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1D_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S1E_TZSID_LOCK            TZC_SEC_TZC_S1E_TZSID_LOCK
#define TZC_SEC_TZC_S1E_TZSID_LOCK_POS        (30U)
#define TZC_SEC_TZC_S1E_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S1E_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S1E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1E_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S1E_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S1E_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1E_TZSID_LOCK_POS))
#define TZC_SEC_TZC_S1F_TZSID_LOCK            TZC_SEC_TZC_S1F_TZSID_LOCK
#define TZC_SEC_TZC_S1F_TZSID_LOCK_POS        (31U)
#define TZC_SEC_TZC_S1F_TZSID_LOCK_LEN        (1U)
#define TZC_SEC_TZC_S1F_TZSID_LOCK_MSK        (((1U << TZC_SEC_TZC_S1F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1F_TZSID_LOCK_POS)
#define TZC_SEC_TZC_S1F_TZSID_LOCK_UMSK       (~(((1U << TZC_SEC_TZC_S1F_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_S1F_TZSID_LOCK_POS))

