RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
/* 0x380 : tzc_psrama_tzsrg_ctrl */
#define TZC_SEC_TZC_PSRAMA_TZSRG_CTRL_OFFSET   (0x380)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN      TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN_POS  (0U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN_LEN  (2U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN_MSK  (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_ID_EN_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN      TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN_POS  (2U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN_LEN  (2U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN_MSK  (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R1_ID_EN_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN      TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN_POS  (4U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN_LEN  (2U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN_MSK  (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R2_ID_EN_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN         TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN_POS     (16U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN_LEN     (1U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN_MSK     (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN_UMSK    (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_EN_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN         TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN_POS     (17U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN_LEN     (1U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN_MSK     (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN_UMSK    (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R1_EN_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN         TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN_POS     (18U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN_LEN     (1U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN_MSK     (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN_UMSK    (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R2_EN_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK       TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK_POS   (24U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK_LEN   (1U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK_MSK   (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_LOCK_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK       TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK_POS   (25U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK_LEN   (1U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK_MSK   (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R1_LOCK_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK       TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK_POS   (26U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK_LEN   (1U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK_MSK   (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R2_LOCK_POS))

/* 0x384 : tzc_psrama_tzsrg_adr_mask */
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_OFFSET    (0x384)
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK           TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_POS       (0U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LEN       (16U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_MSK       (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_UMSK      (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK      TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK_POS  (16U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK_LEN  (1U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK_MSK  (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK_UMSK (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_ADR_MASK_LOCK_POS))

/* 0x388 : tzc_psrama_tzsrg_r0 */
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_OFFSET     (0x388)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_END        TZC_SEC_TZC_PSRAMA_TZSRG_R0_END
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_END_POS    (0U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_END_LEN    (16U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_END_MSK    (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_END_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_END_UMSK   (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_END_POS))
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_START      TZC_SEC_TZC_PSRAMA_TZSRG_R0_START
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_START_POS  (16U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_START_LEN  (16U)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_START_MSK  (((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_START_POS)
#define TZC_SEC_TZC_PSRAMA_TZSRG_R0_START_UMSK (~(((1U << TZC_SEC_TZC_PSRAMA_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_PSRAMA_TZSRG_R0_START_POS))

