RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
    /* 0x58  reserved */
    uint8_t RESERVED0x58[168];

    /* 0x100 : tzc_bmx_tzmid */
    union {
        struct {
            uint32_t tzc_pico_tzmid      : 1; /* [    0],        r/w,        0x0 */
            uint32_t tzc_mm_tzmid        : 1; /* [    1],        r/w,        0x0 */
            uint32_t tzc_usb_tzmid       : 1; /* [    2],        r/w,        0x0 */
            uint32_t tzc_wifi_tzmid      : 1; /* [    3],        r/w,        0x0 */
            uint32_t tzc_cci_tzmid       : 1; /* [    4],        r/w,        0x0 */
            uint32_t tzc_sdhm_tzmid      : 1; /* [    5],        r/w,        0x0 */
            uint32_t tzc_emacA_tzmid     : 1; /* [    6],        r/w,        0x0 */
            uint32_t tzc_cpu_tzmid       : 1; /* [    7],        r/w,        0x0 */
            uint32_t tzc_dma_tzmid       : 1; /* [    8],        r/w,        0x0 */
            uint32_t tzc_dma2_tzmid      : 1; /* [    9],        r/w,        0x0 */
            uint32_t tzc_lz4_tzmid       : 1; /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_15      : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t tzc_pico_tzmid_sel  : 1; /* [   16],        r/w,        0x1 */
            uint32_t tzc_mm_tzmid_sel    : 1; /* [   17],        r/w,        0x1 */
            uint32_t tzc_usb_tzmid_sel   : 1; /* [   18],        r/w,        0x1 */
            uint32_t tzc_wifi_tzmid_sel  : 1; /* [   19],        r/w,        0x1 */
            uint32_t tzc_cci_tzmid_sel   : 1; /* [   20],        r/w,        0x1 */
            uint32_t tzc_sdhm_tzmid_sel  : 1; /* [   21],        r/w,        0x1 */
            uint32_t tzc_emacA_tzmid_sel : 1; /* [   22],        r/w,        0x1 */
            uint32_t tzc_cpu_tzmid_sel   : 1; /* [   23],        r/w,        0x1 */
            uint32_t tzc_dma_tzmid_sel   : 1; /* [   24],        r/w,        0x1 */
            uint32_t tzc_dma2_tzmid_sel  : 1; /* [   25],        r/w,        0x1 */
            uint32_t tzc_lz4_tzmid_sel   : 1; /* [   26],        r/w,        0x1 */
            uint32_t reserved_27_31      : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_bmx_tzmid;

    /* 0x104 : tzc_bmx_tzmid_lock */
    union {
        struct {
            uint32_t tzc_pico_tzmid_lock  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tzc_mm_tzmid_lock    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tzc_usb_tzmid_lock   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t tzc_wifi_tzmid_lock  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t tzc_cci_tzmid_lock   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t tzc_sdhm_tzmid_lock  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t tzc_emacA_tzmid_lock : 1;  /* [    6],        r/w,        0x0 */
            uint32_t tzc_cpu_tzmid_lock   : 1;  /* [    7],        r/w,        0x0 */
            uint32_t tzc_dma_tzmid_lock   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t tzc_dma2_tzmid_lock  : 1;  /* [    9],        r/w,        0x0 */
            uint32_t tzc_lz4_tzmid_lock   : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31       : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_bmx_tzmid_lock;

    /* 0x108 : tzc_bmx_s0 */
    union {
        struct {
            uint32_t tzc_bmx_mm_tzsid_en     : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_bmx_dma_tzsid_en    : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_bmx_dma2_tzsid_en   : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_bmx_pwr_tzsid_en    : 2;  /* [ 7: 6],        r/w,        0x3 */
            uint32_t tzc_bmx_sdh_tzsid_en    : 2;  /* [ 9: 8],        r/w,        0x3 */
            uint32_t tzc_bmx_emac_tzsid_en   : 2;  /* [11:10],        r/w,        0x3 */
            uint32_t reserved_12_15          : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t tzc_bmx_mm_tzsid_lock   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t tzc_bmx_dma_tzsid_lock  : 1;  /* [   17],        r/w,        0x0 */
            uint32_t tzc_bmx_dma2_tzsid_lock : 1;  /* [   18],        r/w,        0x0 */
            uint32_t tzc_bmx_pwr_tzsid_lock  : 1;  /* [   19],        r/w,        0x0 */
            uint32_t tzc_bmx_sdh_tzsid_lock  : 1;  /* [   20],        r/w,        0x0 */
            uint32_t tzc_bmx_emac_tzsid_lock : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31          : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_bmx_s0;

    /* 0x10C : tzc_bmx_s1 */
    union {
        struct {
            uint32_t tzc_bmx_s10_tzsid_en : 2; /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_bmx_s11_tzsid_en : 2; /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_bmx_s12_tzsid_en : 2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_bmx_s13_tzsid_en : 2; /* [ 7: 6],        r/w,        0x3 */
            uint32_t tzc_bmx_s14_tzsid_en : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t tzc_bmx_s15_tzsid_en : 2; /* [11:10],        r/w,        0x3 */
            uint32_t tzc_bmx_s16_tzsid_en : 2; /* [13:12],        r/w,        0x3 */
            uint32_t tzc_bmx_s17_tzsid_en : 2; /* [15:14],        r/w,        0x3 */
            uint32_t tzc_bmx_s18_tzsid_en : 2; /* [17:16],        r/w,        0x3 */
            uint32_t tzc_bmx_s19_tzsid_en : 2; /* [19:18],        r/w,        0x3 */
            uint32_t tzc_bmx_s1a_tzsid_en : 2; /* [21:20],        r/w,        0x3 */
            uint32_t tzc_bmx_s1b_tzsid_en : 2; /* [23:22],        r/w,        0x3 */
            uint32_t tzc_bmx_s1c_tzsid_en : 2; /* [25:24],        r/w,        0x3 */
            uint32_t tzc_bmx_s1d_tzsid_en : 2; /* [27:26],        r/w,        0x3 */
            uint32_t tzc_bmx_s1e_tzsid_en : 2; /* [29:28],        r/w,        0x3 */
            uint32_t tzc_bmx_s1f_tzsid_en : 2; /* [31:30],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } tzc_bmx_s1;

    /* 0x110 : tzc_bmx_s2 */
    union {
        struct {
            uint32_t tzc_bmx_s20_tzsid_en : 2; /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_bmx_s21_tzsid_en : 2; /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_bmx_s22_tzsid_en : 2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_bmx_s23_tzsid_en : 2; /* [ 7: 6],        r/w,        0x3 */
            uint32_t tzc_bmx_s24_tzsid_en : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t tzc_bmx_s25_tzsid_en : 2; /* [11:10],        r/w,        0x3 */
            uint32_t tzc_bmx_s26_tzsid_en : 2; /* [13:12],        r/w,        0x3 */
            uint32_t tzc_bmx_s27_tzsid_en : 2; /* [15:14],        r/w,        0x3 */
            uint32_t tzc_bmx_s28_tzsid_en : 2; /* [17:16],        r/w,        0x3 */
            uint32_t tzc_bmx_s29_tzsid_en : 2; /* [19:18],        r/w,        0x3 */
            uint32_t tzc_bmx_s2a_tzsid_en : 2; /* [21:20],        r/w,        0x3 */
            uint32_t tzc_bmx_s2b_tzsid_en : 2; /* [23:22],        r/w,        0x3 */
            uint32_t tzc_bmx_s2c_tzsid_en : 2; /* [25:24],        r/w,        0x3 */
            uint32_t tzc_bmx_s2d_tzsid_en : 2; /* [27:26],        r/w,        0x3 */
            uint32_t tzc_bmx_s2e_tzsid_en : 2; /* [29:28],        r/w,        0x3 */
            uint32_t tzc_bmx_s2f_tzsid_en : 2; /* [31:30],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } tzc_bmx_s2;

    /* 0x114 : tzc_bmx_s_lock */
    union {
        struct {
            uint32_t tzc_bmx_s10_tzsid_lock : 1; /* [    0],        r/w,        0x0 */
            uint32_t tzc_bmx_s11_tzsid_lock : 1; /* [    1],        r/w,        0x0 */
            uint32_t tzc_bmx_s12_tzsid_lock : 1; /* [    2],        r/w,        0x0 */
            uint32_t tzc_bmx_s13_tzsid_lock : 1; /* [    3],        r/w,        0x0 */
            uint32_t tzc_bmx_s14_tzsid_lock : 1; /* [    4],        r/w,        0x0 */
            uint32_t tzc_bmx_s15_tzsid_lock : 1; /* [    5],        r/w,        0x0 */
            uint32_t tzc_bmx_s16_tzsid_lock : 1; /* [    6],        r/w,        0x0 */
            uint32_t tzc_bmx_s17_tzsid_lock : 1; /* [    7],        r/w,        0x0 */
            uint32_t tzc_bmx_s18_tzsid_lock : 1; /* [    8],        r/w,        0x0 */
            uint32_t tzc_bmx_s19_tzsid_lock : 1; /* [    9],        r/w,        0x0 */
            uint32_t tzc_bmx_s1a_tzsid_lock : 1; /* [   10],        r/w,        0x0 */
            uint32_t tzc_bmx_s1b_tzsid_lock : 1; /* [   11],        r/w,        0x0 */
            uint32_t tzc_bmx_s1c_tzsid_lock : 1; /* [   12],        r/w,        0x0 */
            uint32_t tzc_bmx_s1d_tzsid_lock : 1; /* [   13],        r/w,        0x0 */
            uint32_t tzc_bmx_s1e_tzsid_lock : 1; /* [   14],        r/w,        0x0 */
            uint32_t tzc_bmx_s1f_tzsid_lock : 1; /* [   15],        r/w,        0x0 */
            uint32_t tzc_bmx_s20_tzsid_lock : 1; /* [   16],        r/w,        0x0 */
            uint32_t tzc_bmx_s21_tzsid_lock : 1; /* [   17],        r/w,        0x0 */
            uint32_t tzc_bmx_s22_tzsid_lock : 1; /* [   18],        r/w,        0x0 */
            uint32_t tzc_bmx_s23_tzsid_lock : 1; /* [   19],        r/w,        0x0 */
            uint32_t tzc_bmx_s24_tzsid_lock : 1; /* [   20],        r/w,        0x0 */
            uint32_t tzc_bmx_s25_tzsid_lock : 1; /* [   21],        r/w,        0x0 */
            uint32_t tzc_bmx_s26_tzsid_lock : 1; /* [   22],        r/w,        0x0 */
            uint32_t tzc_bmx_s27_tzsid_lock : 1; /* [   23],        r/w,        0x0 */
            uint32_t tzc_bmx_s28_tzsid_lock : 1; /* [   24],        r/w,        0x0 */
            uint32_t tzc_bmx_s29_tzsid_lock : 1; /* [   25],        r/w,        0x0 */
            uint32_t tzc_bmx_s2a_tzsid_lock : 1; /* [   26],        r/w,        0x0 */
            uint32_t tzc_bmx_s2b_tzsid_lock : 1; /* [   27],        r/w,        0x0 */
            uint32_t tzc_bmx_s2c_tzsid_lock : 1; /* [   28],        r/w,        0x0 */
            uint32_t tzc_bmx_s2d_tzsid_lock : 1; /* [   29],        r/w,        0x0 */
            uint32_t tzc_bmx_s2e_tzsid_lock : 1; /* [   30],        r/w,        0x0 */
            uint32_t tzc_bmx_s2f_tzsid_lock : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_bmx_s_lock;

    /* 0x118  reserved */
    uint8_t RESERVED0x118[40];

    /* 0x140 : tzc_ocram_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_ocram_tzsrg_r0_id_en : 4; /* [ 3: 0],        r/w,        0xf */
            uint32_t tzc_ocram_tzsrg_r1_id_en : 4; /* [ 7: 4],        r/w,        0xf */
            uint32_t tzc_ocram_tzsrg_r2_id_en : 4; /* [11: 8],        r/w,        0xf */
            uint32_t tzc_ocram_tzsrg_rx_id_en : 4; /* [15:12],        r/w,        0xf */
            uint32_t tzc_ocram_tzsrg_r0_en    : 1; /* [   16],        r/w,        0x0 */
            uint32_t tzc_ocram_tzsrg_r1_en    : 1; /* [   17],        r/w,        0x0 */
            uint32_t tzc_ocram_tzsrg_r2_en    : 1; /* [   18],        r/w,        0x0 */
            uint32_t tzc_ocram_tzsrg_rx_en    : 1; /* [   19],        r/w,        0x0 */
            uint32_t tzc_ocram_tzsrg_r0_lock  : 1; /* [   20],        r/w,        0x0 */
            uint32_t tzc_ocram_tzsrg_r1_lock  : 1; /* [   21],        r/w,        0x0 */
            uint32_t tzc_ocram_tzsrg_r2_lock  : 1; /* [   22],        r/w,        0x0 */
            uint32_t tzc_ocram_tzsrg_rx_lock  : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_31           : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_ocram_tzsrg_ctrl;

    /* 0x144 : tzc_ocram_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_ocram_tzsrg_adr_mask      : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15                : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_ocram_tzsrg_adr_mask_lock : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_ocram_tzsrg_adr_mask;

    /* 0x148 : tzc_ocram_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_ocram_tzsrg_r0_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15           : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_ocram_tzsrg_r0_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31           : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_ocram_tzsrg_r0;

