RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
    /* 0x348 : tzc_l2sram_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_l2sram_tzsrg_r0_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15            : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r0_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31            : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_l2sram_tzsrg_r0;

    /* 0x34C : tzc_l2sram_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_l2sram_tzsrg_r1_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15            : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r1_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31            : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_l2sram_tzsrg_r1;

    /* 0x350 : tzc_l2sram_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_l2sram_tzsrg_r2_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15            : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r2_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31            : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_l2sram_tzsrg_r2;

    /* 0x354 : tzc_l2sram_tzsrg_r3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_l2sram_tzsrg_r3;

    /* 0x358  reserved */
    uint8_t RESERVED0x358[8];

    /* 0x360 : tzc_vram_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_vram_tzsrg_r0_id_en : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_vram_tzsrg_r1_id_en : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_vram_tzsrg_r2_id_en : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_15           : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t tzc_vram_tzsrg_r0_en    : 1;  /* [   16],        r/w,        0x0 */
            uint32_t tzc_vram_tzsrg_r1_en    : 1;  /* [   17],        r/w,        0x0 */
            uint32_t tzc_vram_tzsrg_r2_en    : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_23          : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t tzc_vram_tzsrg_r0_lock  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t tzc_vram_tzsrg_r1_lock  : 1;  /* [   25],        r/w,        0x0 */
            uint32_t tzc_vram_tzsrg_r2_lock  : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31          : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_vram_tzsrg_ctrl;

    /* 0x364 : tzc_vram_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_vram_tzsrg_adr_mask      : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15               : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_vram_tzsrg_adr_mask_lock : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31               : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_vram_tzsrg_adr_mask;

    /* 0x368 : tzc_vram_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_vram_tzsrg_r0_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_vram_tzsrg_r0_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_vram_tzsrg_r0;

    /* 0x36C : tzc_vram_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_vram_tzsrg_r1_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_vram_tzsrg_r1_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_vram_tzsrg_r1;

    /* 0x370 : tzc_vram_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_vram_tzsrg_r2_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_vram_tzsrg_r2_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_vram_tzsrg_r2;

    /* 0x374 : tzc_vram_tzsrg_r3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_vram_tzsrg_r3;

    /* 0x378  reserved */
    uint8_t RESERVED0x378[8];

    /* 0x380 : tzc_psrama_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_psrama_tzsrg_r0_id_en : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_psrama_tzsrg_r1_id_en : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_psrama_tzsrg_r2_id_en : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_15             : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t tzc_psrama_tzsrg_r0_en    : 1;  /* [   16],        r/w,        0x0 */
            uint32_t tzc_psrama_tzsrg_r1_en    : 1;  /* [   17],        r/w,        0x0 */
            uint32_t tzc_psrama_tzsrg_r2_en    : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_23            : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t tzc_psrama_tzsrg_r0_lock  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t tzc_psrama_tzsrg_r1_lock  : 1;  /* [   25],        r/w,        0x0 */
            uint32_t tzc_psrama_tzsrg_r2_lock  : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31            : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psrama_tzsrg_ctrl;

    /* 0x384 : tzc_psrama_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_psrama_tzsrg_adr_mask      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t tzc_psrama_tzsrg_adr_mask_lock : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psrama_tzsrg_adr_mask;

    /* 0x388 : tzc_psrama_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_psrama_tzsrg_r0_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t tzc_psrama_tzsrg_r0_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_psrama_tzsrg_r0;

