RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/tzc_sec_reg.h
    /* 0x3D4 : tzc_xram_tzsrg_r3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_xram_tzsrg_r3;

    /* 0x3d8  reserved */
    uint8_t RESERVED0x3d8[2856];

    /* 0xF00 : tzc_glb_ctrl_0 */
    union {
        struct {
            uint32_t tzc_glb_pwron_rst_tzsid_en  : 2; /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_glb_cpu_reset_tzsid_en  : 2; /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_glb_sys_reset_tzsid_en  : 2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_glb_cpu2_reset_tzsid_en : 2; /* [ 7: 6],        r/w,        0x3 */
            uint32_t tzc_glb_misc_tzsid_en       : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t tzc_glb_sram_tzsid_en       : 2; /* [11:10],        r/w,        0x3 */
            uint32_t tzc_glb_swrst_tzsid_en      : 2; /* [13:12],        r/w,        0x3 */
            uint32_t tzc_glb_bmx_tzsid_en        : 2; /* [15:14],        r/w,        0x3 */
            uint32_t tzc_glb_dbg_tzsid_en        : 2; /* [17:16],        r/w,        0x3 */
            uint32_t tzc_glb_mbist_tzsid_en      : 2; /* [19:18],        r/w,        0x3 */
            uint32_t tzc_glb_clk_tzsid_en        : 2; /* [21:20],        r/w,        0x3 */
            uint32_t tzc_glb_int_tzsid_en        : 2; /* [23:22],        r/w,        0x3 */
            uint32_t tzc_glb_pwr_tzsid_en        : 2; /* [25:24],        r/w,        0x3 */
            uint32_t reserved_26_31              : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_glb_ctrl_0;

    /* 0xF04 : tzc_glb_ctrl_1 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_glb_ctrl_1;

    /* 0xF08 : tzc_glb_ctrl_2 */
    union {
        struct {
            uint32_t tzc_glb_pwron_rst_tzsid_lock  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tzc_glb_cpu_reset_tzsid_lock  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tzc_glb_sys_reset_tzsid_lock  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t tzc_glb_cpu2_reset_tzsid_lock : 1;  /* [    3],        r/w,        0x0 */
            uint32_t tzc_glb_misc_tzsid_lock       : 1;  /* [    4],        r/w,        0x0 */
            uint32_t tzc_glb_sram_tzsid_lock       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t tzc_glb_swrst_tzsid_lock      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t tzc_glb_bmx_tzsid_lock        : 1;  /* [    7],        r/w,        0x0 */
            uint32_t tzc_glb_dbg_tzsid_lock        : 1;  /* [    8],        r/w,        0x0 */
            uint32_t tzc_glb_mbist_tzsid_lock      : 1;  /* [    9],        r/w,        0x0 */
            uint32_t tzc_glb_clk_tzsid_lock        : 1;  /* [   10],        r/w,        0x0 */
            uint32_t tzc_glb_int_tzsid_lock        : 1;  /* [   11],        r/w,        0x0 */
            uint32_t tzc_glb_pwr_tzsid_lock        : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31                : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_glb_ctrl_2;

    /* 0xf0c  reserved */
    uint8_t RESERVED0xf0c[20];

    /* 0xF20 : tzc_mm_ctrl_0 */
    union {
        struct {
            uint32_t tzc_mm_pwron_rst_tzsid_en  : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_mm_cpu0_reset_tzsid_en : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_mm_sys_reset_tzsid_en  : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_mm_cpu0_tzsid_en       : 2;  /* [ 7: 6],        r/w,        0x3 */
            uint32_t reserved_8_9               : 2;  /* [ 9: 8],       rsvd,        0x0 */
            uint32_t tzc_mm_sram_tzsid_en       : 2;  /* [11:10],        r/w,        0x3 */
            uint32_t tzc_mm_swrst_tzsid_en      : 2;  /* [13:12],        r/w,        0x3 */
            uint32_t reserved_14_19             : 6;  /* [19:14],       rsvd,        0x0 */
            uint32_t tzc_mm_clk_tzsid_en        : 2;  /* [21:20],        r/w,        0x3 */
            uint32_t reserved_22_31             : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_mm_ctrl_0;

    /* 0xF24 : tzc_mm_ctrl_1 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_mm_ctrl_1;

    /* 0xF28 : tzc_mm_ctrl_2 */
    union {
        struct {
            uint32_t tzc_mm_pwron_rst_tzsid_lock  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tzc_mm_cpu0_reset_tzsid_lock : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tzc_mm_sys_reset_tzsid_lock  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t tzc_mm_cpu0_tzsid_lock       : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4                   : 1;  /* [    4],       rsvd,        0x0 */
            uint32_t tzc_mm_sram_tzsid_lock       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t tzc_mm_swrst_tzsid_lock      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_9                 : 3;  /* [ 9: 7],       rsvd,        0x0 */
            uint32_t tzc_mm_clk_tzsid_lock        : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31               : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_mm_ctrl_2;

    /* 0xf2c  reserved */
    uint8_t RESERVED0xf2c[20];

    /* 0xF40 : tzc_se_ctrl_0 */
    union {
        struct {
            uint32_t tzc_se_sha_tzsid_en  : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_se_aes_tzsid_en  : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_se_trng_tzsid_en : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_se_pka_tzsid_en  : 2;  /* [ 7: 6],        r/w,        0x3 */
            uint32_t tzc_se_cdet_tzsid_en : 2;  /* [ 9: 8],        r/w,        0x3 */
            uint32_t tzc_se_gmac_tzsid_en : 2;  /* [11:10],        r/w,        0x3 */
            uint32_t tzc_se_tzsid_crmd    : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15       : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t tzc_se_wdt_dly       : 16; /* [31:16],        r/w,        0x5 */
        } BF;
        uint32_t WORD;
    } tzc_se_ctrl_0;

    /* 0xF44 : tzc_se_ctrl_1 */
    union {
        struct {
            uint32_t tzc_sf_cr_tzsid_en  : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_sf_sec_tzsid_en : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_sf_tzsid_crmd   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_31       : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_se_ctrl_1;

    /* 0xF48 : tzc_se_ctrl_2 */
    union {
        struct {
            uint32_t tzc_se_sha_tzsid_lock  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tzc_se_aes_tzsid_lock  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tzc_se_trng_tzsid_lock : 1;  /* [    2],        r/w,        0x0 */
            uint32_t tzc_se_pka_tzsid_lock  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t tzc_se_cdet_tzsid_lock : 1;  /* [    4],        r/w,        0x0 */
            uint32_t tzc_se_gmac_tzsid_lock : 1;  /* [    5],        r/w,        0x0 */
            uint32_t tzc_se_tzsid_crmd_lock : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_15          : 9;  /* [15: 7],       rsvd,        0x0 */
            uint32_t tzc_sf_cr_tzsid_lock   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t tzc_sf_sec_tzsid_lock  : 1;  /* [   17],        r/w,        0x0 */
            uint32_t tzc_sf_tzsid_crmd_lock : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31         : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_se_ctrl_2;
};

typedef volatile struct tzc_sec_reg tzc_sec_reg_t;

#endif /* __TZC_SEC_REG_H__ */
